{"cells":[{"cell_type":"code","execution_count":1,"id":"eg5cLqrAtzig","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":42803,"status":"ok","timestamp":1701831635089,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"eg5cLqrAtzig","outputId":"4a723657-3229-4548-c675-9f527783130c"},"outputs":[{"name":"stdout","output_type":"stream","text":["Requirement already satisfied: openai in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (1.2.2)\n","Requirement already satisfied: anyio<4,>=3.5.0 in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from openai) (3.7.1)\n","Requirement already satisfied: distro<2,>=1.7.0 in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from openai) (1.8.0)\n","Requirement already satisfied: httpx<1,>=0.23.0 in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from openai) (0.25.1)\n","Requirement already satisfied: pydantic<3,>=1.9.0 in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from openai) (2.4.2)\n","Requirement already satisfied: tqdm>4 in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from openai) (4.66.1)\n","Requirement already satisfied: typing-extensions<5,>=4.5 in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from openai) (4.8.0)\n","Requirement already satisfied: idna>=2.8 in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from anyio<4,>=3.5.0->openai) (3.4)\n","Requirement already satisfied: sniffio>=1.1 in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from anyio<4,>=3.5.0->openai) (1.3.0)\n","Requirement already satisfied: exceptiongroup in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from anyio<4,>=3.5.0->openai) (1.1.3)\n","Requirement already satisfied: certifi in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from httpx<1,>=0.23.0->openai) (2023.7.22)\n","Requirement already satisfied: httpcore in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from httpx<1,>=0.23.0->openai) (1.0.1)\n","Requirement already satisfied: annotated-types>=0.4.0 in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from pydantic<3,>=1.9.0->openai) (0.6.0)\n","Requirement already satisfied: pydantic-core==2.10.1 in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from pydantic<3,>=1.9.0->openai) (2.10.1)\n","Requirement already satisfied: h11<0.15,>=0.13 in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from httpcore->httpx<1,>=0.23.0->openai) (0.14.0)\n","Requirement already satisfied: neo4j in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (5.13.0)\n","Requirement already satisfied: pytz in /nfs/home/hwl6390/msia_490/diego/lib/python3.9/site-packages (from neo4j) (2023.3.post1)\n"]}],"source":["!pip install openai\n","!pip install neo4j"]},{"cell_type":"code","execution_count":2,"id":"242f646c","metadata":{"executionInfo":{"elapsed":1826,"status":"ok","timestamp":1701831698315,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"242f646c"},"outputs":[],"source":["import json\n","import sys\n","import networkx as nx\n","import matplotlib.pyplot as plt\n","\n","import os\n","import requests\n","import gzip\n","import shutil\n","import openai\n","\n","from neo4j import GraphDatabase"]},{"cell_type":"code","execution_count":3,"id":"6dbaedca","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":139,"status":"ok","timestamp":1701831707071,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"6dbaedca","outputId":"cd6c31ba-c9b0-4074-da96-9d043307c653"},"outputs":[{"name":"stdout","output_type":"stream","text":["Have successfully set up OPENAI_API_KEY as an environment variable.\n"]}],"source":["import os\n","import getpass\n","name = 'OPENAI_API_KEY'\n","secret = \"\"#getpass.getpass(\"Enter the OpenAI API Key\")\n","os.environ[name] = secret\n","print(f\"Have successfully set up {name} as an environment variable.\")"]},{"cell_type":"code","execution_count":4,"id":"4e43d728","metadata":{"executionInfo":{"elapsed":208,"status":"ok","timestamp":1701831764238,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"4e43d728"},"outputs":[],"source":["# Define your API key (keep it secret!)\n","openai.api_key = os.environ[name]\n","API_KEY = os.environ[name]"]},{"cell_type":"code","execution_count":5,"id":"3434ae42","metadata":{"executionInfo":{"elapsed":253,"status":"ok","timestamp":1701831768627,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"3434ae42"},"outputs":[],"source":["#import openai\n","from openai import OpenAI\n","\n","client = OpenAI()"]},{"cell_type":"code","execution_count":6,"id":"57da8733","metadata":{"executionInfo":{"elapsed":223,"status":"ok","timestamp":1701831772976,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"57da8733"},"outputs":[],"source":["# Connect to the Neo4j database\n","uri = \"\"  # Change to match your Neo4j server settings\n","username = \"\"      # Change to your Neo4j username\n","password = \"\"      # Change to your Neo4j password\n","\n","# Create a Neo4j driver\n","driver = GraphDatabase.driver(uri, auth=(username, password))"]},{"cell_type":"code","execution_count":7,"id":"c91cfe04","metadata":{"executionInfo":{"elapsed":246,"status":"ok","timestamp":1701831775602,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"c91cfe04"},"outputs":[],"source":["def refine_prompt(raw_prompt, openai_api_key=os.environ['OPENAI_API_KEY']):\n","    \"\"\"\n","    Refines a raw user input using OpenAI's language model to create a more effective prompt.\n","\n","    Parameters:\n","    raw_prompt (str): The original user input.\n","    openai_api_key (str): Your OpenAI API key.\n","\n","    Returns:\n","    dict: A dictionary containing the status ('success' or 'failed') and the refined prompt.\n","    \"\"\"\n","    try:\n","        openai.api_key = openai_api_key\n","\n","        # Constructing the prompt for the LLM to refine the user input\n","        prompt_to_refine = (\n","            \"The following is a plain English user input for querying a graph database: '{}'. \"\n","            \"Rewrite this input into a clearer query format. \"\n","            \"However, do not remove any information related to the database or information related to node type which the user provided. If the input is not clear or relevant, indicate that the user should provide a clearer query. \"\n","            \"Do not remove any information related to database and node attributes.\"\n","            \"For example, if the input is 'I want to know how many nodes are in this database', \"\n","            \"a better format would be 'Find the number of nodes in the database'.\\n\"\n","            \"Refined Input: \".format(raw_prompt)\n","        )\n","\n","        max_tokens = 100\n","        if len(raw_prompt.split()) > 100:\n","            max_tokens = len(raw_prompt.split())\n","\n","        # response = openai.Completion.create(\n","        #     engine=\"text-davinci-003\",  # Use the latest available engine\n","        #     prompt=prompt_to_refine,\n","        #     max_tokens=max_tokens  # Adjust based on your needs\n","        # )\n","        response = client.completions.create(\n","            model=\"text-davinci-003\",  # Use the latest available engine\n","            prompt=prompt_to_refine,\n","            max_tokens=max_tokens  # Adjust based on your needs\n","        )\n","\n","        refined_prompt = response.choices[0].text.strip()\n","\n","\n","        # Check if the refined prompt is valid\n","        if \"provide a clearer query\" in refined_prompt.lower():\n","            return {\"status\": \"failed\", \"updated_user_prompt\": refined_prompt}\n","        else:\n","            return {\"status\": \"success\", \"updated_user_prompt\": refined_prompt}\n","    except Exception as e:\n","        print(f\"Error in refining prompt: {e}\")\n","        return {\"status\": \"failed\", \"updated_user_prompt\": raw_prompt}\n","\n"]},{"cell_type":"code","execution_count":8,"id":"a8812186","metadata":{"executionInfo":{"elapsed":175,"status":"ok","timestamp":1701831779783,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"a8812186"},"outputs":[],"source":["import openai\n","import re\n","\n","from typing import Any, Dict, List, Optional\n","\n","def neo4j_query(query: str, params: dict = {}) -> List[Dict[str, Any]]:\n","\n","    \"\"\"Query Neo4j database.\"\"\"\n","    from neo4j.exceptions import CypherSyntaxError\n","\n","    with driver.session(database=\"neo4j\") as session:\n","        try:\n","            data = session.run(query, params)\n","            return [r.data() for r in data]\n","        except CypherSyntaxError as e:\n","            raise ValueError(f\"Generated Cypher Statement is not valid\\n{e}\")\n","\n","def refresh_schema() -> str:\n","    \"\"\"\n","    Refreshes the Neo4j graph schema information.\n","    \"\"\"\n","\n","\n","    node_properties_query = \"\"\"\n","    CALL apoc.meta.data()\n","    YIELD label, other, elementType, type, property\n","    WHERE NOT type = \"RELATIONSHIP\" AND elementType = \"node\"\n","    WITH label AS nodeLabels, collect({property:property, type:type}) AS properties\n","    RETURN {labels: nodeLabels, properties: properties} AS output\n","\n","    \"\"\"\n","\n","    rel_properties_query = \"\"\"\n","    CALL apoc.meta.data()\n","    YIELD label, other, elementType, type, property\n","    WHERE NOT type = \"RELATIONSHIP\" AND elementType = \"relationship\"\n","    WITH label AS nodeLabels, collect({property:property, type:type}) AS properties\n","    RETURN {type: nodeLabels, properties: properties} AS output\n","    \"\"\"\n","\n","    rel_query = \"\"\"\n","    CALL apoc.meta.data()\n","    YIELD label, other, elementType, type, property\n","    WHERE type = \"RELATIONSHIP\" AND elementType = \"node\"\n","    UNWIND other AS other_node\n","    RETURN {start: label, type: property, end: toString(other_node)} AS output\n","    \"\"\"\n","\n","\n","    node_properties = [el[\"output\"] for el in neo4j_query(node_properties_query)]\n","    rel_properties = [el[\"output\"] for el in neo4j_query(rel_properties_query)]\n","    relationships = [el[\"output\"] for el in neo4j_query(rel_query)]\n","\n","    structured_schema = {\n","        \"node_props\": {el[\"labels\"]: el[\"properties\"] for el in node_properties},\n","        \"rel_props\": {el[\"type\"]: el[\"properties\"] for el in rel_properties},\n","        \"relationships\": relationships,\n","    }\n","    schema_str = f\"\"\"\n","    Node properties are the following:\n","    {node_properties}\n","    Relationship properties are the following:\n","    {rel_properties}\n","    The relationships are the following:\n","    {[f\"(:{el['start']})-[:{el['type']}]->(:{el['end']})\" for el in relationships]}\n","    \"\"\"\n","\n","    return schema_str\n","\n","def get_gpt3_response(curr_schema, question, api_key, model=\"gpt-3.5-turbo\",history=None):\n","    \"\"\"\n","    Send a request to the OpenAI Chat API and get a response from the model.\n","\n","    Args:\n","        prompt (str): The user's question.\n","        context (str): Contextual information to be passed to the model.\n","        api_key (str): Your OpenAI API key.\n","        model (str): The model version to use, default is \"gpt-3.5-turbo\".\n","\n","    Returns:\n","        str: The model's response.\n","    \"\"\"\n","\n","\n","\n","\n","    system_prompt =  \"\"\"\n","\n","    \"Human: Task:Generate Cypher statement to query a graph database.\\nInstructions:\\nUse only the provided\n","    relationship types and properties in the schema.\\nDo not use any other relationship types or\n","    properties that are not provided.\\n\n","    Consider directionality of the graph.\\n\n","    The cypher output should have some indication either as variable name to indicate the requirement of the\n","    question.\\n\n","    Do not include any explanations or apologies in your responses.\\n\n","    Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n","    \\nSchema:\n","    {}\".\n","    \"\"\".format(curr_schema)\n","\n","    # Create the full prompt by combining the system prompt, context, and the user question\n","    messages = [\n","        {\"role\": \"system\", \"content\": system_prompt},\n","        {\"role\": \"user\", \"content\": question}\n","    ]\n","\n","    if history:\n","        messages.extend(history)\n","\n","    ## Use the OpenAI Python client to send the request\n","    response = client.chat.completions.create(\n","        model=model,\n","        messages=messages\n","    )\n","\n","    # Extract the response text and return\n","    return response.choices[0].message.content\n","    #return response.choices[0].message['content']\n","\n","\n","def get_gpt3_response_2(prompt, question, api_key, model=\"gpt-3.5-turbo\",history=None):\n","    \"\"\"\n","    Send a request to the OpenAI Chat API and get a response from the model.\n","\n","    Args:\n","        prompt (str): The user's question.\n","        context (str): Contextual information to be passed to the model.\n","        api_key (str): Your OpenAI API key.\n","        model (str): The model version to use, default is \"gpt-3.5-turbo\".\n","\n","    Returns:\n","        str: The model's response.\n","    \"\"\"\n","\n","\n","\n","    system_prompt =  \"\"\"\n","\n","    \"Human: You are an assistant that helps to form nice and human understandable answers\n","    .\\nThe information part contains the provided information that you must use to construct an answer.\n","    \\nThe provided information is authoritative, you must never doubt it or try to use your internal knowledge\n","    to correct it.\\nMake the answer sound as a response to the question.\n","    Do not mention that you based the result on the given information.\\n\n","    Only If the information is empty then return whatever asked in the question does not exist\\n\n","    Output only the node ids to represent the nodes, unless specified\n","    \\nInformation:\\n{}\"\n","    \"\"\".format(prompt)\n","\n","    # Create the full prompt by combining the system prompt, context, and the user question\n","    messages = [\n","        {\"role\": \"system\", \"content\": system_prompt},\n","        {\"role\": \"user\", \"content\": question}\n","    ]\n","\n","    if history:\n","        messages.extend(history)\n","\n","    ## Use the OpenAI Python client to send the request\n","    response = client.chat.completions.create(\n","        model=model,\n","        messages=messages\n","    )\n","\n","    # Extract the response text and return\n","    return response.choices[0].message.content\n","\n","\n","\n","\n","def lang_chain_custom(question,driver,model=\"gpt-3.5-turbo\"):\n","\n","    curr_schema = refresh_schema()\n","\n","    ## Getting Cypher query\n","    response = get_gpt3_response(curr_schema, question,  API_KEY, model)\n","    print('Cypher Query is',response)\n","    print('\\n')\n","\n","    ## Interacting with neo4j\n","    try:\n","        cypher_response = neo4j_query(response)\n","        cypher_response = cypher_response[:10] ## Limiting it to avoid token limits\n","        print('Neo4j answer is',cypher_response)\n","        print('\\n')\n","\n","    except Exception as e:\n","\n","        #print(str(e))\n","        try:\n","            print('Retrying')\n","            print(str(e))\n","\n","            history = [\n","                    {\"role\": \"assistant\", \"content\": response},\n","                    {\n","                        \"role\": \"user\",\n","                        \"content\": f\"\"\"This query returns an error: {str(e)}\n","                        Give me a improved query that works without any explanations or apologies\"\"\",\n","                    },\n","\n","            ]\n","            #print(history)\n","            response = get_gpt3_response(curr_schema, question,  API_KEY, model,history)\n","            print('New Cypher Query is',response)\n","            print('\\n')\n","\n","            cypher_response = neo4j_query(response)\n","            cypher_response = cypher_response[:10] ## Limiting it to avoid token limits\n","            print('Neo4j answer is',cypher_response)\n","            print('\\n')\n","\n","        except Exception as e:\n","            cypher_response = []\n","\n","    ## Obtaining final answer\n","    response_2 = get_gpt3_response_2(cypher_response, question,  API_KEY, model)\n","    pattern = r'\\bsorry\\b'\n","    # re.IGNORECASE flag makes the search case-insensitive\n","    if(bool(re.search(pattern, response_2, re.IGNORECASE))):\n","\n","        print('Retrying output string')\n","\n","        history = [\n","        {\"role\": \"assistant\", \"content\": response_2},\n","        {\n","            \"role\": \"user\",\n","            \"content\": f\"\"\"This query returns an incomplete answer.\n","            If the information is empty then return does not exist or unknown.\\n\n","            If not, assume the output is a simplified answer to\n","            the question {question}\n","            Give me a improved query that works without any explanations or apologies\"\"\",\n","        },\n","\n","        ]\n","\n","        response_2 = get_gpt3_response_2(cypher_response, question,  API_KEY, model,history)\n","\n","    return response_2"]},{"attachments":{},"cell_type":"markdown","id":"OJ8JlVm0u0mv","metadata":{"id":"OJ8JlVm0u0mv"},"source":["# Results"]},{"attachments":{},"cell_type":"markdown","id":"M06RcM0ku2VT","metadata":{"id":"M06RcM0ku2VT"},"source":["## Number of nodes"]},{"cell_type":"code","execution_count":10,"id":"e95d0bff","metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["Find the number of nodes with type 'Node_201511060000' in the graph database.\n","-----\n","Cypher Query is MATCH (n:Node_201511060000) \n","RETURN COUNT(n) AS NumberOfNodes_201511060000\n","\n","\n","Neo4j answer is [{'NumberOfNodes_201511060000': 78}]\n","\n","\n","The number of nodes with type 'Node_201511060000' in the graph database is 78.\n"]}],"source":["question = \"\"\"\n","How many nodes are there of type Node_201511060000\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)\n"]},{"cell_type":"code","execution_count":9,"id":"4c362d97","metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["Find the number of nodes of type Node_201511060800 in the graph database.\n","-----\n","Cypher Query is MATCH (n:Node_201511060800) RETURN COUNT(n) AS NumberOfNodesOfType_Node_201511060800\n","\n","\n","Neo4j answer is [{'NumberOfNodesOfType_Node_201511060800': 78}]\n","\n","\n","The number of nodes of type Node_201511060800 in the graph database is 78.\n"]}],"source":["question = \"\"\"\n","How many nodes are there of type Node_201511060800\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"DXTjIkr3u4To","metadata":{"id":"DXTjIkr3u4To"},"source":["## Number of edges"]},{"cell_type":"code","execution_count":11,"id":"b7103a86","metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["Find the number of edges between nodes with type Node_201511060000.\n","-----\n","Cypher Query is MATCH (n:Node_201511060000)-[:CONNECTS_201511060000]->(m:Node_201511060000) \n","RETURN count(*) as edgeCount\n","\n","\n","Neo4j answer is [{'edgeCount': 139}]\n","\n","\n","Retrying output string\n","The number of edges between nodes is 139.\n"]}],"source":["question = \"\"\"\n","How many edges are there between the nodes with type Node_201511060000\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":12,"id":"ba159e46","metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["Find the number of edges between the nodes with type Node_201511060800.\n","-----\n","Cypher Query is MATCH (n:Node_201511060800)-[:CONNECTS_201511060800]->(m:Node_201511060800)\n","RETURN COUNT(*) AS NumberOfEdges\n","\n","\n","Neo4j answer is [{'NumberOfEdges': 140}]\n","\n","\n","The number of edges between the nodes with type Node_201511060800 is 140.\n"]}],"source":["question = \"\"\"\n","How many edges are there between the nodes with type Node_201511060800\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"Q_zMmGLYN5l0","metadata":{"id":"Q_zMmGLYN5l0"},"source":["## path length"]},{"attachments":{},"cell_type":"markdown","id":"pzkXeucIGKjX","metadata":{"id":"pzkXeucIGKjX"},"source":["T1"]},{"cell_type":"code","execution_count":9,"id":"M3ZkvapVN8vy","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":8347,"status":"ok","timestamp":1701831871119,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"M3ZkvapVN8vy","outputId":"60007ef1-4ce0-4b2b-ce5e-7d9e8bb43f11"},"outputs":[{"name":"stdout","output_type":"stream","text":["Find all paths from node 22804 to node 28625 where the nodes in the path are of type Node_201511060000 and return the length of each path.\n","-----\n","Cypher Query is MATCH p=(:Node_201511060000{id:'22804'})-[:CONNECTS_201511060000*]->(:Node_201511060000{id:'28625'}) RETURN LENGTH(p) AS path_length\n","\n","\n","Neo4j answer is []\n","\n","\n","Whatever asked in the question does not exist.\n"]}],"source":["# 22804, 48479 and 28625\n","question = \"\"\"\n","What are the paths from node 22804 to node 28625 for nodes of type Node_201511060000? Also, return the path length of each path\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":12,"id":"XHatftpEkHcm","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":12713,"status":"ok","timestamp":1701831995374,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"XHatftpEkHcm","outputId":"b7958387-92ff-4a74-b259-4a9edc653b37"},"outputs":[{"name":"stdout","output_type":"stream","text":["Find the paths from node 22804 to node 48479 for nodes with type Node_201511060000, and return the length of each path.\n","-----\n","Cypher Query is MATCH path = (start:Node_201511060000 {id: \"22804\"})-[:CONNECTS_201511060000*]->(end:Node_201511060000 {id: \"48479\"}) \n","RETURN path, length(path) AS path_length\n","\n","\n","Neo4j answer is []\n","\n","\n","Retrying output string\n","The paths from node 22804 to node 48479 for nodes with type Node_201511060000, and the length of each path are unknown.\n"]}],"source":["question = \"\"\"\n","What are the paths from node 22804 to node 48479 for nodes of type Node_201511060000? Also, return the path length of each path\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":13,"id":"AHy9aoCLkHvT","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":14346,"status":"ok","timestamp":1701832019850,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"AHy9aoCLkHvT","outputId":"68e5042c-2ab3-4525-9efd-3baeae0e3b18"},"outputs":[{"name":"stdout","output_type":"stream","text":["Find all paths from node 48479 to node 28625, where each node in the path is of type Node_201511060000, and return the path length of each path.\n","-----\n","Cypher Query is MATCH p=(start:Node_201511060000{id:\"48479\"})-[:CONNECTS_201511060000*]->(end:Node_201511060000{id:\"28625\"}) \n","RETURN LENGTH(p) AS path_length\n","\n","\n","Neo4j answer is []\n","\n","\n","Retrying output string\n","The paths from node 48479 to node 28625, where each node in the path is of type Node_201511060000, do not exist.\n"]}],"source":["question = \"\"\"\n","What are the paths from node 48479 to node 28625 for nodes of type Node_201511060000? Also, return the path length of each path\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":22,"id":"iHw-OxZiF8fI","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":34904,"status":"ok","timestamp":1701832574230,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"iHw-OxZiF8fI","outputId":"0cacc3b6-2350-454d-b5d8-f4e92d5d0d43"},"outputs":[{"name":"stdout","output_type":"stream","text":["Find all paths from Node 1251 to Node 4844 which include Nodes of type Node_201511060000, and display the paths and path length of each path.\n","-----\n","Cypher Query is MATCH path = (nodeStart:Node_201511060000 {id: \"1251\"})-[:CONNECTS_201511060000*]->(nodeEnd:Node_201511060000 {id: \"4844\"})\n","RETURN path, length(path) as pathLength\n","\n","\n","Neo4j answer is [{'path': [{'id': '1251'}, 'CONNECTS_201511060000', {'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060000', {'country': 'US', 'upstream': '25', 'city': 'Monroe', 'downstream': '5283', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_201511060000', {'country': 'US', 'upstream': '18', 'city': 'Redmond', 'downstream': '1210', 'rank': '108', 'id': '2914', 'state': 'WA', 'org_name': 'NTT America, Inc.', 'as_name': 'NTT-LTD-2914'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '2', 'rank': '11551', 'id': '4844', 'org_name': 'SuperInternet Access Pte Ltd', 'as_name': 'SUPERINTERNET-AS-AP'}], 'pathLength': 6}, {'path': [{'id': '1251'}, 'CONNECTS_201511060000', {'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060000', {'country': 'US', 'upstream': '18', 'city': 'Redmond', 'downstream': '1210', 'rank': '108', 'id': '2914', 'state': 'WA', 'org_name': 'NTT America, Inc.', 'as_name': 'NTT-LTD-2914'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '2', 'rank': '11551', 'id': '4844', 'org_name': 'SuperInternet Access Pte Ltd', 'as_name': 'SUPERINTERNET-AS-AP'}], 'pathLength': 5}, {'path': [{'id': '1251'}, 'CONNECTS_201511060000', {'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '6', 'downstream': '113', 'rank': '4052', 'id': '7473', 'org_name': 'Singapore Telecommunications (SINGTEL Internet Exchange)', 'as_name': 'SINGTEL-AS-AP'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '2', 'rank': '11551', 'id': '4844', 'org_name': 'SuperInternet Access Pte Ltd', 'as_name': 'SUPERINTERNET-AS-AP'}], 'pathLength': 4}, {'path': [{'id': '1251'}, 'CONNECTS_201511060000', {'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'id': '12956'}, 'CONNECTS_201511060000', {'country': 'US', 'upstream': '25', 'city': 'Monroe', 'downstream': '5283', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_201511060000', {'country': 'US', 'upstream': '18', 'city': 'Redmond', 'downstream': '1210', 'rank': '108', 'id': '2914', 'state': 'WA', 'org_name': 'NTT America, Inc.', 'as_name': 'NTT-LTD-2914'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '2', 'rank': '11551', 'id': '4844', 'org_name': 'SuperInternet Access Pte Ltd', 'as_name': 'SUPERINTERNET-AS-AP'}], 'pathLength': 6}, {'path': [{'id': '1251'}, 'CONNECTS_201511060000', {'id': '28625'}, 'CONNECTS_201511060000', {'id': '262589'}, 'CONNECTS_201511060000', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060000', {'country': 'US', 'upstream': '25', 'city': 'Monroe', 'downstream': '5283', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_201511060000', {'country': 'US', 'upstream': '18', 'city': 'Redmond', 'downstream': '1210', 'rank': '108', 'id': '2914', 'state': 'WA', 'org_name': 'NTT America, Inc.', 'as_name': 'NTT-LTD-2914'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '2', 'rank': '11551', 'id': '4844', 'org_name': 'SuperInternet Access Pte Ltd', 'as_name': 'SUPERINTERNET-AS-AP'}], 'pathLength': 6}, {'path': [{'id': '1251'}, 'CONNECTS_201511060000', {'id': '28625'}, 'CONNECTS_201511060000', {'id': '262589'}, 'CONNECTS_201511060000', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060000', {'country': 'US', 'upstream': '18', 'city': 'Redmond', 'downstream': '1210', 'rank': '108', 'id': '2914', 'state': 'WA', 'org_name': 'NTT America, Inc.', 'as_name': 'NTT-LTD-2914'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '2', 'rank': '11551', 'id': '4844', 'org_name': 'SuperInternet Access Pte Ltd', 'as_name': 'SUPERINTERNET-AS-AP'}], 'pathLength': 5}]\n","\n","\n","There are multiple paths from Node 1251 to Node 4844. \n","\n","Path 1: 1251 --> 28625 --> 12989 --> 6762 --> 3356 --> 2914 --> 4844. The path length of this path is 6.\n","\n","Path 2: 1251 --> 28625 --> 12989 --> 6762 --> 2914 --> 4844. The path length of this path is 5.\n","\n","Path 3: 1251 --> 28625 --> 12989 --> 7473 --> 4844. The path length of this path is 4.\n","\n","Path 4: 1251 --> 28625 --> 12989 --> 12956 --> 3356 --> 2914 --> 4844. The path length of this path is 6.\n","\n","Path 5: 1251 --> 28625 --> 262589 --> 6762 --> 3356 --> 2914 --> 4844. The path length of this path is 6.\n","\n","Path 6: 1251 --> 28625 --> 262589 --> 6762 --> 2914 --> 4844. The path length of this path is 5.\n"]}],"source":["question = \"\"\"\n","What are the paths from node 1251 to node 4844 for nodes of type Node_201511060000? Also, return each path and the path length of each path\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"-43RPLmjGngr","metadata":{"id":"-43RPLmjGngr"},"source":["T2"]},{"cell_type":"code","execution_count":20,"id":"3lkuLi_8GP8v","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":20638,"status":"ok","timestamp":1701832456303,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"3lkuLi_8GP8v","outputId":"c515c621-a6ea-456d-aae1-1780f4ae62b0"},"outputs":[{"name":"stdout","output_type":"stream","text":["Find the paths from node 22804 to node 28625 that have Node_201511060800 as a node type, and return each path and the path length of each path.\n","-----\n","Cypher Query is MATCH path=(start:Node_201511060800 {id:'22804'})-[:CONNECTS_201511060800*]-(end:Node_201511060800 {id:'28625'})\n","RETURN path, length(path) as path_length\n","\n","\n","Retrying\n","Existing exports of data: object cannot be re-sized\n","New Cypher Query is MATCH p=(start:Node_201511060800 {id:'22804'})-[:CONNECTS_201511060800*]->(end:Node_201511060800 {id:'28625'})\n","RETURN p, length(p) as path_length\n","\n","\n","Neo4j answer is []\n","\n","\n","Retrying output string\n","The paths from node 22804 to node 28625 that have Node_201511060800 as a node type do not exist.\n"]}],"source":["question = \"\"\"\n","What are the paths from node 22804 to node 28625 for nodes of type Node_201511060800? Also, return each path and the path length of each path\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":17,"id":"OmdYyvAeGsa4","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":6409,"status":"ok","timestamp":1701832245166,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"OmdYyvAeGsa4","outputId":"7b2f07db-8932-4850-a216-cba476692147"},"outputs":[{"name":"stdout","output_type":"stream","text":["Find the paths from node 48479 to node 28625 where the nodes along the path are of type Node_201511060800 and return the path length of each respective path.\n","-----\n","Cypher Query is MATCH path = (a:Node_201511060800 {id: '48479'})-[:CONNECTS_201511060800*]->(b:Node_201511060800 {id: '28625'})\n","RETURN path, length(path) as path_length\n","\n","\n","Neo4j answer is []\n","\n","\n","Whatever you asked in the question does not exist.\n"]}],"source":["# 22804, 48479 and 28625\n","question = \"\"\"\n","What are the paths from node 48479 to node 28625 for nodes of type Node_201511060800? Also, return the path length of each path\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"BO9f2MX1Gs6q","metadata":{"id":"BO9f2MX1Gs6q"},"outputs":[],"source":["# 22804, 48479 and 28625\n","question = \"\"\"\n","What are the paths from node 48479 to node 28625 for nodes of type Node_201511060800? Also, return the path length of each path\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":19,"id":"2eZorl8cGtNb","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":23839,"status":"ok","timestamp":1701832382800,"user":{"displayName":"Yuexin Chen","userId":"09134812435111111537"},"user_tz":360},"id":"2eZorl8cGtNb","outputId":"b58994c0-4e0a-4600-bea4-ebbfb59344ad"},"outputs":[{"name":"stdout","output_type":"stream","text":["Find all paths from node 1251 to node 4844 where the nodes are of type Node_201511060800 and return each path and the length of each path.\n","-----\n","Cypher Query is MATCH path=(start:Node_201511060800{id:'1251'})-[:CONNECTS_201511060800*]->(end:Node_201511060800{id:'4844'})\n","RETURN path, length(path) as path_length\n","\n","\n","Neo4j answer is [{'path': [{'id': '1251'}, 'CONNECTS_201511060800', {'id': '28625'}, 'CONNECTS_201511060800', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '18', 'city': 'Redmond', 'downstream': '1210', 'rank': '108', 'id': '2914', 'state': 'WA', 'org_name': 'NTT America, Inc.', 'as_name': 'NTT-LTD-2914'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '2', 'rank': '11551', 'id': '4844', 'org_name': 'SuperInternet Access Pte Ltd', 'as_name': 'SUPERINTERNET-AS-AP'}], 'path_length': 5}, {'path': [{'id': '1251'}, 'CONNECTS_201511060800', {'id': '28625'}, 'CONNECTS_201511060800', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '17', 'city': 'Washington', 'downstream': '3905', 'rank': '19', 'id': '174', 'state': 'DC', 'org_name': 'Cogent Communications', 'as_name': 'COGENT-174'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '18', 'city': 'Redmond', 'downstream': '1210', 'rank': '108', 'id': '2914', 'state': 'WA', 'org_name': 'NTT America, Inc.', 'as_name': 'NTT-LTD-2914'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '2', 'rank': '11551', 'id': '4844', 'org_name': 'SuperInternet Access Pte Ltd', 'as_name': 'SUPERINTERNET-AS-AP'}], 'path_length': 6}, {'path': [{'id': '1251'}, 'CONNECTS_201511060800', {'id': '28625'}, 'CONNECTS_201511060800', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '6', 'downstream': '113', 'rank': '4052', 'id': '7473', 'org_name': 'Singapore Telecommunications (SINGTEL Internet Exchange)', 'as_name': 'SINGTEL-AS-AP'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '2', 'rank': '11551', 'id': '4844', 'org_name': 'SuperInternet Access Pte Ltd', 'as_name': 'SUPERINTERNET-AS-AP'}], 'path_length': 4}, {'path': [{'id': '1251'}, 'CONNECTS_201511060800', {'id': '28625'}, 'CONNECTS_201511060800', {'id': '262589'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '18', 'city': 'Redmond', 'downstream': '1210', 'rank': '108', 'id': '2914', 'state': 'WA', 'org_name': 'NTT America, Inc.', 'as_name': 'NTT-LTD-2914'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '2', 'rank': '11551', 'id': '4844', 'org_name': 'SuperInternet Access Pte Ltd', 'as_name': 'SUPERINTERNET-AS-AP'}], 'path_length': 5}, {'path': [{'id': '1251'}, 'CONNECTS_201511060800', {'id': '28625'}, 'CONNECTS_201511060800', {'id': '262589'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '17', 'city': 'Washington', 'downstream': '3905', 'rank': '19', 'id': '174', 'state': 'DC', 'org_name': 'Cogent Communications', 'as_name': 'COGENT-174'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '18', 'city': 'Redmond', 'downstream': '1210', 'rank': '108', 'id': '2914', 'state': 'WA', 'org_name': 'NTT America, Inc.', 'as_name': 'NTT-LTD-2914'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '2', 'rank': '11551', 'id': '4844', 'org_name': 'SuperInternet Access Pte Ltd', 'as_name': 'SUPERINTERNET-AS-AP'}], 'path_length': 6}]\n","\n","\n","Here are all the paths from node 1251 to node 4844 where the nodes are of type 'Node_201511060800':\n","\n","1. Path: 1251 -> 28625 -> 12989 -> 6762 -> 2914 -> 4844, Length: 5\n","2. Path: 1251 -> 28625 -> 12989 -> 6762 -> 174 -> 2914 -> 4844, Length: 6\n","3. Path: 1251 -> 28625 -> 12989 -> 7473 -> 4844, Length: 4\n","4. Path: 1251 -> 28625 -> 262589 -> 6762 -> 2914 -> 4844, Length: 5\n","5. Path: 1251 -> 28625 -> 262589 -> 6762 -> 174 -> 2914 -> 4844, Length: 6\n"]}],"source":["# 22804, 48479 and 28625\n","question = \"\"\"\n","What are the paths from node 1251 to node 4844 for nodes of type Node_201511060800? Also, return each path and the path length of each path\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"9YjQcZVru6Ne","metadata":{"id":"9YjQcZVru6Ne"},"source":["# Indegree of one node"]},{"cell_type":"code","execution_count":null,"id":"daNI-UIUvAIj","metadata":{"id":"daNI-UIUvAIj"},"outputs":[],"source":["question = \"\"\"\n","Does a path exist from node 56203 to node 38803 for nodes of type node? If so what is the path?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"-eksvtC6vPeD","metadata":{"id":"-eksvtC6vPeD"},"source":["# Path Existence"]},{"cell_type":"code","execution_count":null,"id":"6c387bd3","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"6c387bd3","outputId":"5f3a6eac-4da1-4e4a-b184-4dcc8b70783e"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the path between nodes 2519 and 18144 if they are of type 'node'?\n","-----\n","Cypher Query is MATCH path = (n:Node{id:'2519'})-[:CONNECTS*..5]->(m:Node{id:'18144'})\n","RETURN path\n","\n","\n","Neo4j answer is []\n","\n","\n","Retrying output string\n","The path between nodes 2519 and 18144 does not exist.\n"]}],"source":["question = \"\"\"\n","Does a path exist from node 2519 to node 18144 for nodes of type node? If so what is the path?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"0f0e00b2","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"0f0e00b2","outputId":"a5e88eca-b2fe-4df4-cd70-39d19c24d054"},"outputs":[{"name":"stdout","output_type":"stream","text":["Find the path from node 56203 to node 38803 for all nodes of type 'node'.\n","-----\n","Cypher Query is MATCH path = (start:Node {id: '56203'})-[:CONNECTS*]->(end:Node {id: '38803'})\n","RETURN path\n","\n","\n","Neo4j answer is [{'path': [{'country': 'AU', 'id': '56203', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'Gtelecom-AUSTRALIA'}, 'CONNECTS', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}]}]\n","\n","\n","The path from node 56203 to node 38803 is as follows: '56203' CONNECTS '38803'. Both nodes are represented by the organization ''Wirefreebroadband Pty Ltd'', with node '56203' being identified as 'Gtelecom-AUSTRALIA' and node '38803' as 'WPL-AS-AP'.\n"]}],"source":["question = \"\"\"\n","Does a path exist from node 56203 to node 38803 for nodes of type node? If so what is the path?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"34dd9269","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"34dd9269","outputId":"8a6cfa24-4257-4c5e-8091-58d601cd22da"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the path from node 56203 to node 38803 for all nodes of type 'node', and return the full node properties along the path.\n","-----\n","Cypher Query is MATCH path = (start:Node {id:\"56203\"})-[:CONNECTS*]->(end:Node {id:\"38803\"}) \n","RETURN nodes(path)\n","\n","\n","Neo4j answer is [{'nodes(path)': [{'country': 'AU', 'id': '56203', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'Gtelecom-AUSTRALIA'}, {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}]}]\n","\n","\n","The path from node 56203 to node 38803 includes two nodes. The first node, with ID 56203, is located in the country 'AU' and is associated with the organization 'Wirefreebroadband Pty Ltd' with the name 'Gtelecom-AUSTRALIA'. The second node, with ID 38803, is also located in the country 'AU' and is associated with the same organization but with the name 'WPL-AS-AP'. This node has two upstream and zero downstream connections and its rank is 9740.\n"]}],"source":["question = \"\"\"\n","Does a path exist from node 56203 to node 38803 for nodes of type node? If so what is the path with full node properties.\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"476bfcab","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"476bfcab","outputId":"f606f850-ca5b-4caa-ca9b-3dfd87a4f10b"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the path from node 3356 to node 7018 of type node_2.\n","-----\n","Cypher Query is MATCH path = (a:Node_2 {id:'3356'})-[:CONNECTS_2*]->(b:Node_2 {id:'7018'}) RETURN path\n","\n","\n","Neo4j answer is [{'path': [{'country': 'US', 'upstream': '26', 'city': 'Monroe', 'downstream': '5281', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_2', {'upstream': '10', 'downstream': '1660', 'rank': '110', 'id': '3257', 'as_name': 'GTT-BACKBONE'}, 'CONNECTS_2', {'country': 'US', 'upstream': '7', 'city': 'MIDDLETOWN', 'downstream': '1592', 'rank': '2', 'id': '7018', 'state': 'NJ', 'org_name': 'AT&T Services, Inc.', 'as_name': 'ATT-INTERNET4'}]}, {'path': [{'country': 'US', 'upstream': '26', 'city': 'Monroe', 'downstream': '5281', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_2', {'country': 'US', 'upstream': '7', 'city': 'MIDDLETOWN', 'downstream': '1592', 'rank': '2', 'id': '7018', 'state': 'NJ', 'org_name': 'AT&T Services, Inc.', 'as_name': 'ATT-INTERNET4'}]}]\n","\n","\n","The path from node 3356 to node 7018 of type node_2 consists of three nodes. Starting from node 3356, it connects to node 3257. From there, it then connects directly to node 7018.\n"]}],"source":["question = \"\"\"\n","Does a path exist from node 3356 to node 7018 for nodes of type node_2? If so what is the path?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"a691dcba","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"a691dcba","outputId":"95647a43-e7eb-4263-9c5f-25ddb8667ddf"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the path from node 4777 to node 7671 for nodes of type node_2.\n","-----\n","Cypher Query is MATCH path = (n:Node_2 {id: '4777'})-[:CONNECTS_2*]->(m:Node_2 {id: '7671'}) \n","RETURN path\n","\n","\n","Neo4j answer is []\n","\n","\n","Retrying output string\n","The path between node 4777 and node 7671 for nodes of type node_2 does not exist.\n"]}],"source":["question = \"\"\"\n","Does a path exist from node 4777 to node 7671 for nodes of type node_2? If so what is the path?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"4dfdd683","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"4dfdd683","outputId":"6f3818ad-81b7-4a36-9cc9-e4a140536bfd"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the path from node 123 to node 7671 for nodes of type node_2, if it exists.\n","-----\n","Cypher Query is MATCH path = (n:Node_2 {id:'123'})-[:CONNECTS_2*]->(m:Node_2 {id:'7671'})\n","RETURN path\n","\n","\n","Neo4j answer is []\n","\n","\n","Retrying output string\n","A path from node 123 to node 7671 for nodes of type node_2 does not exist.\n"]}],"source":["question = \"\"\"\n","Does a path exist from node 123 to node 7671 for nodes of type node_2? If so what is the path?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"bed12bd1","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"bed12bd1","outputId":"53532a32-437f-4ee3-a140-2b5bc7327dd1"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the number of paths from node 56203 to node 38803 for nodes of type 'node'.\n","-----\n","Cypher Query is MATCH p=(n:Node {id:\"56203\"})-[:CONNECTS*]->(m:Node {id:\"38803\"})\n","RETURN COUNT(p) as path_count\n","\n","\n","Neo4j answer is [{'path_count': 1}]\n","\n","\n","There is 1 path from node 56203 to node 38803 for nodes of type 'node'.\n"]}],"source":["question = \"\"\"\n","How many path exists from node 56203 to node 38803 for nodes of type node?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"a1b7b373","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"a1b7b373","outputId":"c815af7b-1240-4fc6-b367-134c67362856"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the number of paths from node 3356 to node 7018 for nodes of type node.\n","-----\n","Cypher Query is MATCH p=(:Node {id: '3356'})-[:CONNECTS*]->(:Node {id: '7018'}) \n","RETURN count(p) AS NumberOfPaths\n","\n","\n","Neo4j answer is [{'NumberOfPaths': 2}]\n","\n","\n","There are 2 paths from node 3356 to node 7018.\n"]}],"source":["question = \"\"\"\n","How many path exists from node 3356 to node 7018 for nodes of type node?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"b4e18aa9","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"b4e18aa9","outputId":"cd5e79ee-7fc2-490a-9bab-45a71edbeb11"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the number of paths between node 56203 (of type node_2) and node 38803 (of type node_2).\n","-----\n","Cypher Query is MATCH path = (:Node_2 {id: \"56203\"})-[:CONNECTS_2*]->(:Node_2 {id: \"38803\"})\n","RETURN count(path) as NumberOfPaths\n","\n","\n","Neo4j answer is [{'NumberOfPaths': 23}]\n","\n","\n","There are 23 paths between node 56203 and node 38803.\n"]}],"source":["question = \"\"\"\n","How many path exists from node 56203 to node 38803 for nodes of type node_2?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"cy_7wJC6vUqQ","metadata":{"id":"cy_7wJC6vUqQ"},"source":["# Find all paths"]},{"cell_type":"code","execution_count":null,"id":"9c1b1d5c","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"9c1b1d5c","outputId":"58a2816c-74fb-4caf-b57c-aaeea75e4acb"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the number of paths from node 2519 to node 10026 that are of type node_2. Also, list these paths.\n","-----\n","Cypher Query is MATCH path = (n:Node_2 {id: '2519'})-[:CONNECTS_2*]->(m:Node_2 {id: '10026'}) \n","RETURN count(path) as NumberOfPaths, collect(path) as ListOfPaths\n","\n","\n","Neo4j answer is [{'NumberOfPaths': 7, 'ListOfPaths': [[{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '8', 'downstream': '437', 'rank': '920', 'id': '4826', 'org_name': 'VOCUS PTY LTD', 'as_name': 'VOCUS-BACKBONE-AS'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '8', 'downstream': '437', 'rank': '920', 'id': '4826', 'org_name': 'VOCUS PTY LTD', 'as_name': 'VOCUS-BACKBONE-AS'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]]}]\n","\n","\n","There are a total of 7 paths from node 2519 to node 10026. The paths are as follows:\n","\n","Path 1: 2519  1221  38803  4826  4608  10026\n","Path 2: 2519  1221  38803  1221  4608  10026\n","Path 3: 2519  1221  38803  1221  4637  1221  4608  10026\n","Path 4: 2519  1221  4608  10026\n","Path 5: 2519  1221  4637  1221  38803  4826  4608  10026\n","Path 6: 2519  1221  4637  1221  38803  1221  4608  10026\n","Path 7: 2519  1221  4637  1221  4608  10026\n"]}],"source":["question = \"\"\"\n","How many path exists from node 2519 to node 10026 for nodes of type node_2? What are they?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"83daff02","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"83daff02","outputId":"2c8e4474-645d-4a37-de0c-9deb65038f07"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find all paths from node 2519 to node 10026 for nodes with the type 'node'.\n","-----\n","Cypher Query is MATCH path = (start:Node{id:'2519'})-[:CONNECTS*]->(end:Node{id:'10026'})\n","RETURN path\n","\n","\n","Neo4j answer is [{'path': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]}]\n","\n","\n","Node 2519, which goes by the name VECTANT and is based in Japan, is connected to node 10026, named TELSTRAGLOBAL, an organization called Telstra International Limited in Australia.\n"]}],"source":["question = \"\"\"\n","Return all paths from node 2519 to node 10026 for nodes of type node?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"1556db7e","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"1556db7e","outputId":"00a9931f-afff-470d-9ac6-c8550b6e854d"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find all paths from node 56203 to node 6939 where the nodes are of type 'node'.\n","-----\n","Cypher Query is MATCH path = (n:Node{id:'56203'})-[:CONNECTS*]->(m:Node{id:'6939'})\n","RETURN path\n","\n","\n","Neo4j answer is [{'path': [{'country': 'AU', 'id': '56203', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'Gtelecom-AUSTRALIA'}, 'CONNECTS', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS', {'country': 'AU', 'upstream': '8', 'downstream': '437', 'rank': '920', 'id': '4826', 'org_name': 'VOCUS PTY LTD', 'as_name': 'VOCUS-BACKBONE-AS'}, 'CONNECTS', {'country': 'US', 'upstream': '23', 'city': 'Fremont', 'downstream': '2151', 'rank': '618', 'id': '6939', 'state': 'CA', 'org_name': 'Hurricane Electric LLC', 'as_name': 'HURRICANE'}]}]\n","\n","\n","Sure, here's the path from node 56203 to node 6939: \n","\n","56203 (Wirefreebroadband Pty Ltd, Gtelecom-AUSTRALIA) -> 38803 (Wirefreebroadband Pty Ltd, WPL-AS-AP) -> 4826 (VOCUS PTY LTD, VOCUS-BACKBONE-AS) -> 6939 (Hurricane Electric LLC, HURRICANE).\n"]}],"source":["question = \"\"\"\n","What are all the paths from node 56203 to node 6939 for nodes of type node?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"_-gDrIWLvYzA","metadata":{"id":"_-gDrIWLvYzA"},"source":["# Find shortest path"]},{"cell_type":"code","execution_count":null,"id":"9f0d9e4d","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"9f0d9e4d","outputId":"61d1bd63-0b56-4fb4-8b0e-1a663a6eac9a"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the shortest path from node 2519 to node 10026 in the graph database, considering only nodes of type node_2.\n","-----\n","Cypher Query is MATCH p=shortestPath((n1:Node_2 {id: '2519'})-[:CONNECTS_2*]->(n2:Node_2 {id: '10026'}))\n","RETURN p\n","\n","\n","Neo4j answer is [{'p': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]}]\n","\n","\n","Retrying output string\n","The shortest path from node 2519 to node 10026 in the graph database, considering only nodes of type node_2, does not exist or is unknown.\n"]}],"source":["question = \"\"\"\n","What is the shortest path from node 2519 to node 10026 for nodes of type node_2?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"Vj6yXNrevcdN","metadata":{"id":"Vj6yXNrevcdN"},"source":["# Find longest path"]},{"cell_type":"code","execution_count":null,"id":"c5e4565a","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"c5e4565a","outputId":"f9ba2961-00fc-4589-911e-7cd57ebf846d"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the longest existing path of nodes of type node_2.\n","-----\n","Cypher Query is MATCH path = (:Node_2)-[:CONNECTS_2*]->(:Node_2) \n","RETURN path \n","ORDER BY length(path) DESC \n","LIMIT 1\n","\n","\n","Neo4j answer is [{'path': [{'country': 'AU', 'upstream': '2', 'downstream': '10', 'rank': '133', 'id': '23969', 'org_name': 'TOT Public Company Limited', 'as_name': 'TOT-NET'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '9', 'downstream': '43', 'rank': '11319', 'id': '4651', 'org_name': 'CAT Telecom Public Company Limited', 'as_name': 'THAI-GATEWAY'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '1', 'downstream': '0', 'rank': '56868', 'id': '9737', 'org_name': 'TOT Public Company Limited', 'as_name': 'TOTNET-TH-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '15', 'rank': '12272', 'id': '38040', 'org_name': 'TOT Public Company Limited', 'as_name': 'GLOBAL-TRANSIT-TOT-IIG-TH'}, 'CONNECTS_2', {'country': 'US', 'upstream': '16', 'city': 'Redmond', 'downstream': '1207', 'rank': '109', 'id': '2914', 'state': 'WA', 'org_name': 'NTT America, Inc.', 'as_name': 'NTT-LTD-2914'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '112', 'rank': '18', 'id': '4713', 'as_name': 'OCN'}, 'CONNECTS_2', {'country': 'JP', 'upstream': '4', 'downstream': '246', 'rank': '36', 'id': '2516', 'as_name': 'KDDI'}, 'CONNECTS_2', {'country': 'US', 'upstream': '2', 'city': 'Monroe', 'downstream': '535', 'rank': '21', 'id': '209', 'state': 'LA', 'org_name': 'CenturyLink Communications, LLC', 'as_name': 'CENTURYLINK-US-LEGACY-QWEST'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '4', 'downstream': '17', 'rank': '1823', 'id': '7670', 'as_name': 'CTNET'}, 'CONNECTS_2', {'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '8', 'downstream': '437', 'rank': '920', 'id': '4826', 'org_name': 'VOCUS PTY LTD', 'as_name': 'VOCUS-BACKBONE-AS'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'JP', 'upstream': '4', 'downstream': '246', 'rank': '36', 'id': '2516', 'as_name': 'KDDI'}, 'CONNECTS_2', {'country': 'US', 'upstream': '26', 'city': 'Monroe', 'downstream': '5281', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_2', {'upstream': '10', 'downstream': '1660', 'rank': '110', 'id': '3257', 'as_name': 'GTT-BACKBONE'}, 'CONNECTS_2', {'country': 'DE', 'upstream': '3', 'downstream': '19', 'rank': '1001', 'id': '12586', 'org_name': 'GHOSTnet GmbH', 'as_name': 'ASGHOSTNET'}, 'CONNECTS_2', {'country': 'DE', 'upstream': '1', 'downstream': '0', 'rank': '63781', 'id': '57821', 'org_name': 'Nonattached Network e.V.', 'as_name': 'NONATTACHED-AS'}]}]\n","\n","\n","The longest existing path of nodes of type node_2 is 23969 - 4651 - 9737 - 38040 - 2914 - 4713 - 2516 - 209 - 7670 - 2519 - 1221 - 38803 - 4826 - 4608 - 10026 - 4637 - 1221 - 4637 - 2516 - 3356 - 3257 - 12586 - 57821.\n"]}],"source":["question = \"\"\"\n","What is the longest existing path for nodes of type node_2?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"d6da97e4","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"d6da97e4","outputId":"92f0f170-b8f6-4290-b436-e2e38ab04923"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Determine if node 10026 is reachable from node 2519, and provide the path if it is.\n","-----\n","Cypher Query is MATCH path=(:Node {id:'2519'})-[:CONNECTS*]->(:Node {id:'10026'}) RETURN path\n","\n","\n","Neo4j answer is [{'path': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]}]\n","\n","\n","Yes, node 10026 is reachable from node 2519. The path is through node 3 and node 64.\n"]}],"source":["question = \"\"\"\n","Is node 10026 reachable from node 2519? If so, what is the path?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"996b77ed","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"996b77ed","outputId":"48408fde-12f0-439c-b464-bda096e4e2ee"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the path, if any, from node 2519 to node 18144.\n","-----\n","Cypher Query is MATCH path = (n:Node{id:'2519'})-[:CONNECTS*]->(m:Node{id:'18144'}) RETURN path\n","\n","\n","Neo4j answer is []\n","\n","\n","The path from node 2519 to node 18144 does not exist.\n"]}],"source":["question = \"\"\"\n","Is node 18144 reachable from node 2519? If so, what is the path?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"52b8c61b","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"52b8c61b","outputId":"47f2e324-4e86-4732-f758-fa57b2a40962"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the number of paths that traverse through node 10026, considering only one path for each ending node.\n","-----\n","Cypher Query is MATCH (n {id: '10026'})-[r*]->(m)\n","WITH COUNT(DISTINCT LAST (r)) AS Paths\n","RETURN Paths\n","\n","\n","Neo4j answer is [{'Paths': 96}]\n","\n","\n","Retrying output string\n","There are no paths that traverse through node 10026.\n"]}],"source":["question = \"\"\"\n","How many paths traverse through node 10026? For each ending node,consider only one path\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"3_NbmS00v4uu","metadata":{"id":"3_NbmS00v4uu"},"source":["## Change in path"]},{"cell_type":"code","execution_count":null,"id":"7a9a7960","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":27469,"status":"ok","timestamp":1701799180535,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"7a9a7960","outputId":"e806e41b-48c2-4715-bf00-427ea8774bc6"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the paths between node 28625 and 4608 at time t1 (using node type Node_201511060000 and relationship CONNECTS_201511060000) and time t2 (using node type Node_201511060800 and relationship CONNECTS_201511060800). Have there been any changes between the two timestamps and if so, specify the changes.\n","-----\n","Cypher Query is MATCH path_t1 = (n1:Node_201511060000 {id: '28625'})-[:CONNECTS_201511060000*..]->(n2:Node_201511060000 {id: '4608'})\n","MATCH path_t2 = (n3:Node_201511060800 {id: '28625'})-[:CONNECTS_201511060800*..]->(n4:Node_201511060800 {id: '4608'})\n","RETURN path_t1, path_t2, path_t1 <> path_t2 AS change_detected\n","\n","\n","Neo4j answer is [{'path_t1': [{'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'path_t2': [{'id': '28625'}, 'CONNECTS_201511060800', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'change_detected': True}, {'path_t1': [{'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'path_t2': [{'id': '28625'}, 'CONNECTS_201511060800', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '25', 'city': 'Monroe', 'downstream': '5283', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'change_detected': True}, {'path_t1': [{'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'path_t2': [{'id': '28625'}, 'CONNECTS_201511060800', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'change_detected': True}, {'path_t1': [{'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'path_t2': [{'id': '28625'}, 'CONNECTS_201511060800', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '17', 'city': 'Washington', 'downstream': '3905', 'rank': '19', 'id': '174', 'state': 'DC', 'org_name': 'Cogent Communications', 'as_name': 'COGENT-174'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '25', 'city': 'Monroe', 'downstream': '5283', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'change_detected': True}, {'path_t1': [{'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'path_t2': [{'id': '28625'}, 'CONNECTS_201511060800', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '17', 'city': 'Washington', 'downstream': '3905', 'rank': '19', 'id': '174', 'state': 'DC', 'org_name': 'Cogent Communications', 'as_name': 'COGENT-174'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'change_detected': True}, {'path_t1': [{'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'path_t2': [{'id': '28625'}, 'CONNECTS_201511060800', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060800', {'id': '12956'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '25', 'city': 'Monroe', 'downstream': '5283', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'change_detected': True}, {'path_t1': [{'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'path_t2': [{'id': '28625'}, 'CONNECTS_201511060800', {'id': '262589'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '25', 'city': 'Monroe', 'downstream': '5283', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'change_detected': True}, {'path_t1': [{'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'path_t2': [{'id': '28625'}, 'CONNECTS_201511060800', {'id': '262589'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'change_detected': True}, {'path_t1': [{'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'path_t2': [{'id': '28625'}, 'CONNECTS_201511060800', {'id': '262589'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '17', 'city': 'Washington', 'downstream': '3905', 'rank': '19', 'id': '174', 'state': 'DC', 'org_name': 'Cogent Communications', 'as_name': 'COGENT-174'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '25', 'city': 'Monroe', 'downstream': '5283', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'change_detected': True}, {'path_t1': [{'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'id': '12989', 'org_name': 'StackPath LLC', 'as_name': 'StackPath'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'path_t2': [{'id': '28625'}, 'CONNECTS_201511060800', {'id': '262589'}, 'CONNECTS_201511060800', {'upstream': '8', 'downstream': '539', 'rank': '2276', 'id': '6762', 'as_name': 'SEABONE-NET'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '17', 'city': 'Washington', 'downstream': '3905', 'rank': '19', 'id': '174', 'state': 'DC', 'org_name': 'Cogent Communications', 'as_name': 'COGENT-174'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '10', 'downstream': '445', 'rank': '551', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '194', 'rank': '3032', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}], 'change_detected': True}]\n","\n","\n","At time t1, the path between node 28625 and 4608 goes through the following node sequence: 12989 - 4637 - 1221. At time t2, there are multiple paths detected with different node sequences, as follow:\n","\n","Path 1: 12989 - 4637 - 1221\n","\n","Path 2: 12989 - 6762 - 3356 - 4637 - 1221\n","\n","Path 3: 12989 - 6762 - 174 - 3356 - 4637 - 1221\n","\n","Path 4: 12989 - 12956 - 3356 - 4637 - 1221\n","\n","Path 5: 12989 - 262589 - 6762 - 3356 - 4637 - 1221\n","\n","Path 6: 12989 - 262589 - 6762 - 174 - 4637 - 1221\n","\n","Yes, there have been several changes in the paths between the two timestamps. The path has become more complex at time t2 compared to time t1, possibly indicating changes in the routes between node 28625 and 4608. Significant changes are the inclusion of new nodes 6762, 174, 3356, 12956, and 262589 in the paths at time t2 compared to time t1.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1.\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, have the paths from node 28625 to node 4608 changed? If so, how did it change?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"SBG47FLKJBX5","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":26969,"status":"ok","timestamp":1701799749420,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"SBG47FLKJBX5","outputId":"cd228648-3d15-4551-d626-11235ce1d5c2"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the changes in the paths from node 204016 to 48479 in the graph with nodes of type Node_201511060000 and relationship CONNECTS_201511060000 at time t1 and nodes of type Node_201511060800 and relationship CONNECTS_201511060800 at time t2.\n","-----\n","Cypher Query is MATCH path_t1 = (n1:Node_201511060000{ id: '204016' })-[:CONNECTS_201511060000*]->(n2:Node_201511060000{ id: '48479' })\n","MATCH path_t2 = (n3:Node_201511060800{ id: '204016' })-[:CONNECTS_201511060800*]->(n4:Node_201511060800{ id: '48479' })\n","RETURN path_t1 as path_at_t1, path_t2 as path_at_t2\n","\n","\n","Neo4j answer is [{'path_at_t1': [{'country': 'AZ', 'upstream': '1', 'downstream': '0', 'rank': '69109', 'id': '204016', 'org_name': 'International Bank of Azerbaijan OJSC', 'as_name': 'ABBBank'}, 'CONNECTS_201511060000', {'country': 'RU', 'upstream': '2', 'downstream': '0', 'rank': '23135', 'id': '49478', 'org_name': 'Provodov.net Ltd.', 'as_name': 'PROVODOV_NET-AS'}, 'CONNECTS_201511060000', {'country': 'RU', 'upstream': '4', 'downstream': '7', 'rank': '13250', 'id': '48479', 'org_name': 'KUBAN-TELECOM Ltd.', 'as_name': 'KUBAN-TELECOM-AS'}], 'path_at_t2': [{'country': 'AZ', 'upstream': '1', 'downstream': '0', 'rank': '69109', 'id': '204016', 'org_name': 'International Bank of Azerbaijan OJSC', 'as_name': 'ABBBank'}, 'CONNECTS_201511060800', {'country': 'RU', 'upstream': '2', 'downstream': '0', 'rank': '23135', 'id': '49478', 'org_name': 'Provodov.net Ltd.', 'as_name': 'PROVODOV_NET-AS'}, 'CONNECTS_201511060800', {'country': 'RU', 'upstream': '4', 'downstream': '7', 'rank': '13250', 'id': '48479', 'org_name': 'KUBAN-TELECOM Ltd.', 'as_name': 'KUBAN-TELECOM-AS'}]}]\n","\n","\n","Both at time t1 and t2, the paths from node 204016 to node 48479 remain the same. The path is directly through node 49478 in both cases. There are no changes in the paths during the given time frames.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1.\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, have the paths from node 204016 to node 48479 changed? If so, how did it change?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"6KExb0j0YJ7a","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":31472,"status":"ok","timestamp":1701805860218,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"6KExb0j0YJ7a","outputId":"9e8764bf-1d6a-4c3e-8c39-b220b739b90c"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the shortest paths from node 28625 to node 2497 in the graph with Node_201511060000 and CONNECTS_201511060000 relationship elements at t1, and Node_201511060800 and CONNECTS_201511060800 relationship elements at t2. Determine if the shortest path between node 28625 and node 2497 has changed between t1 and t2, and how it has changed if so.\n","-----\n","Cypher Query is MATCH p1=shortestPath((a:Node_201511060000 {id:\"28625\"})-[:CONNECTS_201511060000*]-(b:Node_201511060000 {id: \"2497\"}))\n","MATCH p2=shortestPath((c:Node_201511060800 {id:\"28625\"})-[:CONNECTS_201511060800*]-(d:Node_201511060800 {id: \"2497\"}))\n","RETURN p1, p2, LENGTH(p1) = LENGTH(p2) as pathLengthUnchanged, CASE WHEN LENGTH(p1) = LENGTH(p2) THEN NULL ELSE LENGTH(p2) - LENGTH(p1) END as pathLengthDifference\n","\n","\n","Neo4j answer is [{'p1': [{'id': '28625'}, 'CONNECTS_201511060000', {'country': 'US', 'upstream': '1', 'city': 'Ashburn', 'downstream': '0', 'rank': '58258', 'id': '23148', 'state': 'VA', 'org_name': 'Verizon Business', 'as_name': 'TERRENAP'}, 'CONNECTS_201511060000', {'country': 'FR', 'upstream': '2', 'downstream': '5', 'rank': '7639', 'id': '29608', 'org_name': 'Absolight SARL', 'as_name': 'WAN2MANY-AS'}, 'CONNECTS_201511060000', {'country': 'US', 'upstream': '25', 'city': 'Monroe', 'downstream': '5283', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_201511060000', {'country': 'JP', 'upstream': '4', 'downstream': '173', 'rank': '169', 'id': '2497', 'as_name': 'IIJ'}], 'p2': [{'id': '28625'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '1', 'city': 'Ashburn', 'downstream': '0', 'rank': '58258', 'id': '23148', 'state': 'VA', 'org_name': 'Verizon Business', 'as_name': 'TERRENAP'}, 'CONNECTS_201511060800', {'country': 'FR', 'upstream': '2', 'downstream': '5', 'rank': '7639', 'id': '29608', 'org_name': 'Absolight SARL', 'as_name': 'WAN2MANY-AS'}, 'CONNECTS_201511060800', {'upstream': '7', 'downstream': '597', 'rank': '850', 'id': '20485', 'as_name': 'TRANSTELECOM'}, 'CONNECTS_201511060800', {'country': 'JP', 'upstream': '4', 'downstream': '173', 'rank': '169', 'id': '2497', 'as_name': 'IIJ'}], 'pathLengthUnchanged': True, 'pathLengthDifference': None}]\n","\n","\n","The shortest path from node 28625 to node 2497 at t1, with Node_201511060000 and CONNECTS_201511060000 relationship elements, goes through nodes 23148 in Ashburn, US, 29608 in France, and 3356 in Monroe, US.\n","\n","At t2, with Node_201511060800 and CONNECTS_201511060800 relationship elements, the shortest path goes through nodes 23148 in Ashburn, US, 29608 in France, and 20485.\n","\n","The shortest path length from node 28625 to node 2497 remains unchanged between t1 and t2. However, the path has altered, as node 3356 in Monroe, US, replaced by node 20485 at t2.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1.\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, have the shortest paths from node 28625 to node 2497 changed? If so, how did it change?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"cu1Cn9FE-U5u","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":26783,"status":"ok","timestamp":1701813275575,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"cu1Cn9FE-U5u","outputId":"d2d73cb8-dbb9-4f53-813e-f5f8b0663a61"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the shortest path from node 31133 to node 4777 of the graph with node type Node_201511060000 and relationship CONNECTS_201511060000 at time t1, and compare it to the shortest path from node 31133 to node 4777 of the graph with node type Node_201511060800 and relationship CONNECTS_201511060800 at time t2. Have the shortest paths changed between t1 and t2, and if\n","-----\n","Cypher Query is MATCH (a:Node_201511060000{id:\"31133\"}), (b:Node_201511060000{id:\"4777\"}), p=shortestPath((a)-[:CONNECTS_201511060000*..15]->(b))\n","WITH p as path_t1\n","MATCH (c:Node_201511060800{id:\"31133\"}), (d:Node_201511060800{id:\"4777\"}), p=shortestPath((c)-[:CONNECTS_201511060800*..15]->(d))\n","WITH path_t1, p as path_t2\n","RETURN path_t1, path_t2, CASE WHEN path_t1 = path_t2 THEN FALSE ELSE TRUE END AS hasChanged\n","\n","\n","Neo4j answer is [{'path_t1': [{'upstream': '8', 'downstream': '459', 'rank': '468', 'id': '31133', 'as_name': 'MF-MGSM-AS'}, 'CONNECTS_201511060000', {'country': 'US', 'upstream': '25', 'city': 'Monroe', 'downstream': '5283', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_201511060000', {'country': 'JP', 'upstream': '4', 'downstream': '173', 'rank': '169', 'id': '2497', 'as_name': 'IIJ'}, 'CONNECTS_201511060000', {'country': 'AU', 'upstream': '3', 'downstream': '33', 'rank': '47303', 'id': '4777', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-COLO'}], 'path_t2': [{'upstream': '8', 'downstream': '459', 'rank': '468', 'id': '31133', 'as_name': 'MF-MGSM-AS'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '17', 'city': 'Washington', 'downstream': '3905', 'rank': '19', 'id': '174', 'state': 'DC', 'org_name': 'Cogent Communications', 'as_name': 'COGENT-174'}, 'CONNECTS_201511060800', {'country': 'US', 'upstream': '18', 'city': 'Redmond', 'downstream': '1210', 'rank': '108', 'id': '2914', 'state': 'WA', 'org_name': 'NTT America, Inc.', 'as_name': 'NTT-LTD-2914'}, 'CONNECTS_201511060800', {'country': 'JP', 'upstream': '4', 'downstream': '173', 'rank': '169', 'id': '2497', 'as_name': 'IIJ'}, 'CONNECTS_201511060800', {'country': 'AU', 'upstream': '3', 'downstream': '33', 'rank': '47303', 'id': '4777', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-COLO'}], 'hasChanged': True}]\n","\n","\n","Yes, the shortest paths from node 31133 to node 4777 have indeed changed between time t1 and t2. At t1, the path was 31133  3356  2497  4777, with nodes being in countries Russia, U.S., Japan, and Australia respectively. While at t2, the path changed to 31133  174  2914  2497  4777, representing a route through Russia, U.S., U.S., Japan, and Australia respectively. Hence, there were modifications in the path network.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1.\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, have the shortest paths from node 31133 to node 4777 changed? If so, how did it change?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"-FNTg-nC-mpl","metadata":{"id":"-FNTg-nC-mpl"},"source":["# Change in no of paths"]},{"cell_type":"code","execution_count":null,"id":"yu58WgTx-qHS","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":18166,"status":"ok","timestamp":1701814683165,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"yu58WgTx-qHS","outputId":"eb749647-09e2-467d-a4a9-f45299465b7a"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the number of paths from node 28625 to node 50300 between graph t1 (defined by node type Node_201511060000 and relationship CONNECTS_201511060000) and graph t2 (defined by node type Node_201511060800 and relationship CONNECTS_201511060800) and compare the number of paths between the two graphs.\n","-----\n","Cypher Query is MATCH p1=(n1:Node_201511060000 {id: '28625'})-[:CONNECTS_201511060000*]->(m1:Node_201511060000 {id: '50300'})\n","WITH count(p1) as t1_paths\n","MATCH p2=(n2:Node_201511060800 {id: '28625'})-[:CONNECTS_201511060800*]->(m2:Node_201511060800 {id: '50300'})\n","RETURN t1_paths as Total_Paths_in_T1, count(p2) as Total_Paths_in_T2\n","\n","\n","Neo4j answer is [{'Total_Paths_in_T1': 9, 'Total_Paths_in_T2': 7}]\n","\n","\n","In graph t1, defined by node type Node_201511060000 and relationship CONNECTS_201511060000, there are a total of 9 paths from node 28625 to node 50300. Meanwhile, in graph t2, defined by node type Node_201511060800 and relationship CONNECTS_201511060800, there are a total of 7 paths between the same nodes. Comparing the two, there are more paths present in graph t1 than in graph t2.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1.\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, are there any change in number of paths from node 28625 to node 50300?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"8tzfJXteCoA_","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":19247,"status":"ok","timestamp":1701814730169,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"8tzfJXteCoA_","outputId":"f8fac4b9-dd91-42d1-ebe6-8594fe1d79b0"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the difference in the number of paths between nodes 2906 and 29608 from the graph at time t1 (with nodes of type Node_201511060000 and the relationship CONNECTS_201511060000) and the graph at time t2 (with nodes of type Node_201511060800 and the relationship CONNECTS_201511060800).\n","-----\n","Cypher Query is MATCH p1=(n1:Node_201511060000{id:'2906'})-[:CONNECTS_201511060000*]->(m1:Node_201511060000{id:'29608'}),\n","      p2=(n2:Node_201511060800{id:'2906'})-[:CONNECTS_201511060800*]->(m2:Node_201511060800{id:'29608'})\n","RETURN abs(size(p1) - size(p2)) AS DifferenceInPathCount\n","\n","\n","Retrying\n","Generated Cypher Statement is not valid\n","{code: Neo.ClientError.Statement.SyntaxError} {message: Type mismatch: expected String or List<T> but was Path (line 3, column 17 (offset: 227))\n","\"RETURN abs(size(p1) - size(p2)) AS DifferenceInPathCount\"\n","                 ^}\n","New Cypher Query is MATCH (n1:Node_201511060000{id:'2906'}), (m1:Node_201511060000{id:'29608'}),\n","      (n2:Node_201511060800{id:'2906'}), (m2:Node_201511060800{id:'29608'})\n","WITH n1, m1, n2, m2\n","MATCH p1=shortestPath((n1)-[:CONNECTS_201511060000*]-(m1)),\n","      p2=shortestPath((n2)-[:CONNECTS_201511060800*]-(m2))\n","RETURN abs(length(p1) - length(p2)) AS DifferenceInPathCount\n","\n","\n","Neo4j answer is [{'DifferenceInPathCount': 0}]\n","\n","\n","The number of paths between nodes 2906 and 29608 at time t1 and t2 are the same.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1.\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, are there any change in number of paths from node 2906 to node 29608?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"JriumUfjEEDQ","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":27002,"status":"ok","timestamp":1701814854788,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"JriumUfjEEDQ","outputId":"3dd53990-e3d0-4f10-c09b-deaee08a30a4"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find out if there are any changes in the number of paths from node 2906 to node 29608 between graphs with node type Node_201511060000 and the relationship CONNECTS_201511060000 at time t1, and node type Node_201511060800 and the relationship CONNECTS_201511060800 at time t2.\n","-----\n","Cypher Query is MATCH p_t1=(n1:Node_201511060000{id:'2906'})-[:CONNECTS_201511060000*]->(n2:Node_201511060000{id:'29608'})\n","RETURN count(p_t1) as Paths_t1\n","\n","MATCH p_t2=(n1:Node_201511060800{id:'2906'})-[:CONNECTS_201511060800*]->(n2:Node_201511060800{id:'29608'})\n","RETURN count(p_t2) as Paths_t2\n","\n","\n","Retrying\n","Generated Cypher Statement is not valid\n","{code: Neo.ClientError.Statement.SyntaxError} {message: RETURN can only be used at the end of the query (line 2, column 1 (offset: 107))\n","\"RETURN count(p_t1) as Paths_t1\"\n"," ^}\n","New Cypher Query is MATCH p_t1=(n1:Node_201511060000{id:'2906'})-[:CONNECTS_201511060000*]->(n2:Node_201511060000{id:'29608'})\n","WITH count(p_t1) as Paths_t1\n","MATCH p_t2=(n1:Node_201511060800{id:'2906'})-[:CONNECTS_201511060800*]->(n2:Node_201511060800{id:'29608'})\n","RETURN Paths_t1, count(p_t2) as Paths_t2\n","\n","\n","Neo4j answer is [{'Paths_t1': 4, 'Paths_t2': 6}]\n","\n","\n","Yes, there are changes in the number of paths from node 2906 to node 29608 between the two times. At time t1, there were 4 paths, and at time t2, the number of paths increased to 6.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1.\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, are there any change in number of paths from node 2906 to node 29608?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"LuYOP4i5EgXu","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":20398,"status":"ok","timestamp":1701814998968,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"LuYOP4i5EgXu","outputId":"c6f0d17e-978c-46fe-ab42-1fd9508596b5"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the number of paths from node 1251 to node 4844 with Node_201511060000 as source and CONNECTS_201511060000 as relationship type at time t1 and Node_201511060800 as source and CONNECTS_201511060800 as relationship type at time t2 and compare the number of paths between t1 and t2.\n","-----\n","Cypher Query is MATCH path_t1=(n1:Node_201511060000{id:'1251'})-[:CONNECTS_201511060000*]->(n2:Node_201511060000{id:'4844'})\n","WITH count(path_t1) AS num_paths_t1\n","MATCH path_t2=(n3:Node_201511060800{id:'1251'})-[:CONNECTS_201511060800*]->(n4:Node_201511060800{id:'4844'})\n","RETURN num_paths_t1 AS number_of_paths_at_t1, count(path_t2) AS number_of_paths_at_t2\n","\n","\n","Neo4j answer is [{'number_of_paths_at_t1': 6, 'number_of_paths_at_t2': 5}]\n","\n","\n","At time t1, while taking Node_201511060000 as a source and CONNECTS_201511060000 as a relationship type, there were 6 paths from node 1251 to node 4844. However, at time t2, with Node_201511060800 as a source and CONNECTS_201511060800 as a relationship type, the number of paths reduced to 5.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1.\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, are there any change in number of paths from node 1251 to node 4844?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"mItLtgE5FC0f","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":19670,"status":"ok","timestamp":1701815090385,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"mItLtgE5FC0f","outputId":"c4df4b1f-6006-490e-9f17-0dcbe5326cac"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the difference in the number of paths between graph G1, which consists of the nodes of type Node_201511060000 and the relationship CONNECTS_201511060000, and graph G2, which consists of the nodes of type Node_201511060800 and the relationship CONNECTS_201511060800, from node 1251 to node 4844.\n","-----\n","Cypher Query is MATCH path1 = (n1:Node_201511060000 {id: '1251'})-[:CONNECTS_201511060000*..]->(m1:Node_201511060000 {id: '4844'})\n","WITH count(path1) as G1_paths\n","MATCH path2 = (n2:Node_201511060800 {id: '1251'})-[:CONNECTS_201511060800*..]->(m2:Node_201511060800 {id: '4844'})\n","RETURN G1_paths - count(path2) as path_diff\n","\n","\n","Retrying\n","Generated Cypher Statement is not valid\n","{code: Neo.ClientError.Statement.SyntaxError} {message: Aggregation column contains implicit grouping expressions. For example, in 'RETURN n.a, n.a + n.b + count(*)' the aggregation expression 'n.a + n.b + count(*)' includes the implicit grouping key 'n.b'. It may be possible to rewrite the query by extracting these grouping/aggregation expressions into a preceding WITH clause. Illegal expression(s): G1_paths (line 4, column 8 (offset: 267))\n","\"RETURN G1_paths - count(path2) as path_diff\"\n","        ^}\n","New Cypher Query is MATCH path1 = (n1:Node_201511060000 {id: '1251'})-[:CONNECTS_201511060000*..]->(m1:Node_201511060000 {id: '4844'})\n","WITH count(path1) as G1_paths\n","MATCH path2 = (n2:Node_201511060800 {id: '1251'})-[:CONNECTS_201511060800*..]->(m2:Node_201511060800 {id: '4844'})\n","WITH G1_paths, count(path2) as G2_paths\n","RETURN G1_paths - G2_paths AS path_diff\n","\n","\n","Neo4j answer is [{'path_diff': 1}]\n","\n","\n","The difference in the number of paths between graph G1 and G2, from node 1251 to node 4844, is 1.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph G1.\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph G2.\n","Between G1 and G2, are there any change in number of paths from node 1251 to node 4844?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"f1wy5aTqKX2B","metadata":{"id":"f1wy5aTqKX2B"},"source":["# Diff in shortest and current path"]},{"cell_type":"code","execution_count":null,"id":"7cz2nRlDKV4z","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":39041,"status":"ok","timestamp":1701816614134,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"7cz2nRlDKV4z","outputId":"97b6421d-128e-4ce6-9ae3-db58593992d9"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find out if the current path from 1251 to 4844 (1251-28625-12989-6762-3356-2914-4844) for Node_201511060000 is different from the shortest path possible.\n","-----\n","Cypher Query is MATCH p=(n1:Node_201511060000 {id:\"1251\"})-[:CONNECTS_201511060000*]->(n2:Node_201511060000 {id: \"4844\"})\n","WHERE ALL(node IN nodes(p) WHERE node.id IN [\"1251\",\"28625\",\"12989\",\"6762\",\"3356\",\"2914\",\"4844\"])\n","WITH p, length(p) AS currentPathLength\n","MATCH sp=shortestPath((n1:Node_201511060000 {id:\"1251\"})-[:CONNECTS_201511060000*]->(n2:Node_201511060000 {id:\"4844\"}))\n","WITH sp, length(sp) AS shortestPathLength, currentPathLength\n","RETURN CASE \n","         WHEN shortestPathLength < currentPathLength THEN sp \n","         ELSE p\n","       END AS path, currentPathLength = shortestPathLength AS isPathShortest\n","\n","\n","Retrying\n","Generated Cypher Statement is not valid\n","{code: Neo.ClientError.Statement.SyntaxError} {message: Variable `p` not defined (line 8, column 15 (offset: 513))\n","\"         ELSE p\"\n","               ^}\n","New Cypher Query is MATCH p=(n1:Node_201511060000 {id:\"1251\"})-[:CONNECTS_201511060000*]->(n2:Node_201511060000 {id: \"4844\"})\n","WHERE ALL(node IN nodes(p) WHERE node.id IN [\"1251\",\"28625\",\"12989\",\"6762\",\"3356\",\"2914\",\"4844\"])\n","WITH length(p) AS currentPathLength\n","MATCH sp=shortestPath((n1:Node_201511060000 {id:\"1251\"})-[:CONNECTS_201511060000*]->(n2:Node_201511060000 {id:\"4844\"}))\n","WITH length(sp) AS shortestPathLength, currentPathLength\n","RETURN currentPathLength = shortestPathLength AS isPathShortest\n","\n","\n","Neo4j answer is [{'isPathShortest': False}, {'isPathShortest': False}]\n","\n","\n","No, the current path from 1251 to 4844 (1251-28625-12989-6762-3356-2914-4844) for Node_201511060000 is not the shortest path possible.\n"]}],"source":["question = \"\"\"\n","If the current path from 1251 to 4844 is 1251-28625-12989-6762-3356-2914-4844 for node type Node_201511060000,\n","is it differnt from the shortest path possible?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"5JgJIqowKWAm","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":49978,"status":"ok","timestamp":1701817229565,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"5JgJIqowKWAm","outputId":"50ccdb1c-40a0-4632-cb54-e2b04420f125"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the shortest path possible from Node_201511060000 1251 to 4844, and determine the difference between this path and the current path: 1251-28625-12989-6762-3356-2914-4844.\n","-----\n","Cypher Query is MATCH (startNode:Node_201511060000 { id: '1251' }),(endNode:Node_201511060000 { id: '4844' }),\n","path = shortestPath((startNode)-[:CONNECTS_201511060000*]-(endNode))\n","RETURN path as ShortestPath, length(path) as ShortestPathLength\n","\n","MATCH currentPath=(s:Node_201511060000 {id:'1251'})-[:CONNECTS_201511060000*]->(n1:Node_201511060000 {id:'28625'})-[:CONNECTS_201511060000*]->(n2:Node_201511060000 {id:'12989'})-[:CONNECTS_201511060000*]->(n3:Node_201511060000 {id:'6762'})-[:CONNECTS_201511060000*]->(n4:Node_201511060000 {id:'3356'})-[:CONNECTS_201511060000*]->(n5:Node_201511060000 {id:'2914'})-[:CONNECTS_201511060000*]->(endNode:Node_201511060000 {id:'4844'})\n","RETURN length(currentPath) as CurrentPathLength\n","\n","RETURN ShortestPathLength - CurrentPathLength as DifferenceInPathLength\n","\n","\n","Retrying\n","Generated Cypher Statement is not valid\n","{code: Neo.ClientError.Statement.SyntaxError} {message: Variable `ShortestPathLength` not defined (line 8, column 8 (offset: 716))\n","\"RETURN ShortestPathLength - CurrentPathLength as DifferenceInPathLength\"\n","        ^}\n","New Cypher Query is MATCH (startNode:Node_201511060000 { id: '1251' }),(endNode:Node_201511060000 { id: '4844' }),\n","shortestPath = shortestPath((startNode)-[:CONNECTS_201511060000*]-(endNode))\n","\n","MATCH currentPath=(s:Node_201511060000 {id:'1251'})-[:CONNECTS_201511060000*]->(n1:Node_201511060000 {id:'28625'})-[:CONNECTS_201511060000*]->(n2:Node_201511060000 {id:'12989'})-[:CONNECTS_201511060000*]->(n3:Node_201511060000 {id:'6762'})-[:CONNECTS_201511060000*]->(n4:Node_201511060000 {id:'3356'})-[:CONNECTS_201511060000*]->(n5:Node_201511060000 {id:'2914'})-[:CONNECTS_201511060000*]->(endNode:Node_201511060000 {id:'4844'})\n","\n","WITH startNode, endNode, shortestPath, currentPath\n","RETURN length(shortestPath) - length(currentPath) as DifferenceInPathLength\n","\n","\n","Neo4j answer is [{'DifferenceInPathLength': -2}]\n","\n","\n","The shortest path from Node_201511060000 1251 to 4844 is two hops shorter than the current path: 1251-28625-12989-6762-3356-2914-4844.\n"]}],"source":["question = \"\"\"\n","If the current path from 1251 to 4844 is 1251-28625-12989-6762-3356-2914-4844 for node type Node_201511060000,\n","What is the shortest path possible and what is the difference?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"ScpDplHvN1Bd","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":29205,"status":"ok","timestamp":1701817473158,"user":{"displayName":"Kiran Sheena","userId":"12163465458160144570"},"user_tz":360},"id":"ScpDplHvN1Bd","outputId":"64e766fb-afdf-400e-ee22-e74aaecd321d"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the shortest path from Node_201511060000 at 28625 to 50300 and find the difference between the current path of 28625-12989-6762-3356-2914-50300 and the shortest path.\n","-----\n","Cypher Query is MATCH path=shortestPath((n1:Node_201511060000 {id: '28625'})-[:CONNECTS_201511060000*..10]->(n2:Node_201511060000 {id: '50300'}))\n","WITH length(path) as shortestPathLength\n","MATCH path2=(n3:Node_201511060000 {id: '28625'})-[:CONNECTS_201511060000]->(n4:Node_201511060000 {id: '12989'})\n","-[:CONNECTS_201511060000]->(n5:Node_201511060000 {id: '6762'})\n","-[:CONNECTS_201511060000]->(n6:Node_201511060000 {id: '3356'})\n","-[:CONNECTS_201511060000]->(n7:Node_201511060000 {id: '2914'})\n","-[:CONNECTS_201511060000]->(n8:Node_201511060000 {id: '50300'})\n","RETURN length(path2) - shortestPathLength AS pathDifference\n","\n","\n","Neo4j answer is [{'pathDifference': 3}]\n","\n","\n","The difference between the current path and the shortest path from Node_201511060000 at 28625 to 50300 is 3.\n"]}],"source":["question = \"\"\"\n","If the current path from 28625 to 50300 is 28625-12989-6762-3356-2914-50300 for node type Node_201511060000,\n","What is the shortest path possible and what is the difference?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"sJDezt0Dv9bv","metadata":{"id":"sJDezt0Dv9bv"},"source":["## Isolated nodes"]},{"cell_type":"code","execution_count":13,"id":"4de07301","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"4de07301","outputId":"729e2668-0d07-422f-e5dc-03d2bb860e3d"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find all isolated nodes of type Node_201511060000 and their unique ids in the network.\n","-----\n","Cypher Query is MATCH (n:Node_201511060000)\n","WHERE NOT (n)-[:CONNECTS_201511060000]-()\n","RETURN DISTINCT n.id AS Unique_Isolated_Node_IDs\n","\n","\n","Neo4j answer is []\n","\n","\n","Whatever you asked in the question does not exist.\n"]}],"source":["question = \"\"\"\n","Are there any isolated nodes of type Node_201511060000 in the network? Can you mention their ids?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":14,"id":"42e63fcd","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"42e63fcd","outputId":"e75952aa-368e-4a67-8ce9-f263664cd6ec"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find all isolated nodes of type Node_201511060800 in the network and list them all.\n","-----\n","Cypher Query is MATCH (n:Node_201511060800) WHERE NOT (n)-[:CONNECTS_201511060800]-() RETURN n\n","\n","\n","Neo4j answer is []\n","\n","\n","Whatever you asked in the question does not exist.\n"]}],"source":["question = \"\"\"\n","Are there any isolated nodes of type Node_201511060800 in the network? Can you name all?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"DreLMHxzwAT5","metadata":{"id":"DreLMHxzwAT5"},"source":["## Indegree"]},{"cell_type":"code","execution_count":null,"id":"19ae0b9c","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":6149,"status":"ok","timestamp":1701795141211,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"19ae0b9c","outputId":"6e4a8fbe-ff42-4419-f6ff-85fb84591ddb"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the in degree of node 22804 of Node_201511060000 connected by CONNECTS_201511060000 at time t1.\n","-----\n","Cypher Query is MATCH (n:Node_201511060000 {id: '22804'})<-[:CONNECTS_201511060000]-(connectedNode)\n","RETURN count(connectedNode) as inDegreeT1\n","\n","\n","Neo4j answer is [{'inDegreeT1': 0}]\n","\n","\n","The in degree of node 22804 of Node_201511060000 connected by CONNECTS_201511060000 at time t1 is 0.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1.\n","What is the in degree of node 22804 at t1?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"GcW9SbGc5Tft","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":5498,"status":"ok","timestamp":1701795172285,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"GcW9SbGc5Tft","outputId":"8c0a0d5c-d1b4-441f-a4f0-4abcb9b73a96"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the in degree of Node_201511060800 with id 22804 at time t2 using the CONNECTS_201511060800 relationship.\n","-----\n","Cypher Query is MATCH (n:Node_201511060800 {id:'22804'})<-[r:CONNECTS_201511060800]-()\n","RETURN COUNT(r) AS in_degree\n","\n","\n","Neo4j answer is [{'in_degree': 0}]\n","\n","\n","The in degree of Node_201511060800 with id 22804 at time t2 using the CONNECTS_201511060800 relationship is 0.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","What is the in degree of node 22804 at t2?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"b364eb0d","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":5747,"status":"ok","timestamp":1701795199938,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"b364eb0d","outputId":"1ed49f84-1761-48eb-f9da-26985206d340"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the in degree of Node_201511060000 with identifier 48479 at time t1, considering CONNECTS_201511060000 relationship in the graph.\n","-----\n","Cypher Query is MATCH (n:Node_201511060000)<-[:CONNECTS_201511060000]-(connectedNodes) WHERE n.id = '48479' \n","RETURN COUNT(connectedNodes) AS InDegree_At_T1\n","\n","\n","Neo4j answer is [{'InDegree_At_T1': 9}]\n","\n","\n","The in-degree of Node_201511060000 with identifier 48479 at time t1, considering the CONNECTS_201511060000 relationship, is 9.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1\n","What is the in degree of node 48479 at t1?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"9Ex9wdFK5fKi","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":5649,"status":"ok","timestamp":1701795218161,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"9Ex9wdFK5fKi","outputId":"5dea7e0f-5f2d-4ab2-b297-557f6ccbe0ea"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the in degree of node 48479 of node type Node_201511060800 connected by relationship CONNECTS_201511060800 at time t2.\n","-----\n","Cypher Query is MATCH (n:Node_201511060800)<-[:CONNECTS_201511060800]-(m)\n","WHERE n.id = '48479'\n","RETURN COUNT(m) AS InDegree_T2\n","\n","\n","Neo4j answer is [{'InDegree_T2': 10}]\n","\n","\n","The in-degree of node 48479 of node type Node_201511060800 connected by relationship CONNECTS_201511060800 at time t2 is 10.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2\n","What is the in degree of node 48479 at t2?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"fVw68OHk5lHu","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":5111,"status":"ok","timestamp":1701795261815,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"fVw68OHk5lHu","outputId":"ddf8132d-487d-43d7-bab3-bdcd414671f3"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the in-degree of node 28625 of type Node_201511060000 which has relation CONNECTS_201511060000 at time t1.\n","-----\n","Cypher Query is MATCH (n:Node_201511060000 {id: '28625'})<-[:CONNECTS_201511060000]-(m) \n","RETURN COUNT(m) AS InDegree_T1\n","\n","\n","Neo4j answer is [{'InDegree_T1': 16}]\n","\n","\n","The in-degree of node 28625 of type Node_201511060000 which has relation CONNECTS_201511060000 at time t1 is 16.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1\n","What is the in degree of node 28625 at t1?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"22c94f35","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":5361,"status":"ok","timestamp":1701795267175,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"22c94f35","outputId":"2efba6da-0686-47df-92c9-0a73202efbec"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the in degree of Node_201511060800 with node ID of 28625 in the graph at time t2 using the CONNECTS_201511060800 relationship.\n","-----\n","Cypher Query is MATCH (n:Node_201511060800)<-[:CONNECTS_201511060800]-() WHERE n.id = '28625' RETURN COUNT(*) AS In_Degree_T2\n","\n","\n","Neo4j answer is [{'In_Degree_T2': 16}]\n","\n","\n","The in-degree of Node_201511060800 with node ID of 28625 in the graph at time t2 using the CONNECTS_201511060800 relationship is 16.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2\n","What is the in degree of node 28625 at t2?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"k1WARzUM6xHv","metadata":{"id":"k1WARzUM6xHv"},"source":["## Outdegree"]},{"cell_type":"code","execution_count":null,"id":"4neSl7ac6xHx","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":4875,"status":"ok","timestamp":1701795551828,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"4neSl7ac6xHx","outputId":"f4ef4a08-9e1d-4aac-b199-db5f1c3f0de3"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the outdegree of node 22804 of type Node_201511060000 connected by relationship CONNECTS_201511060000 at time t1.\n","-----\n","Cypher Query is MATCH (n:Node_201511060000 {id: '22804'})-[r:CONNECTS_201511060000]->() \n","RETURN COUNT(r) AS Outdegree_t1\n","\n","\n","Neo4j answer is [{'Outdegree_t1': 1}]\n","\n","\n","The outdegree of node 22804 of type Node_201511060000 connected by relationship CONNECTS_201511060000 at time t1 is 1.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1.\n","What is the outdegree of node 22804 at t1?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"KOsqij8w6xHx","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":5882,"status":"ok","timestamp":1701795558276,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"KOsqij8w6xHx","outputId":"4d2294da-bb8b-4f8a-f9fc-8634eeca3b6a"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the outdegree of node 22804 of node type Node_201511060800 in the CONNECTS_201511060800 graph at time t2.\n","-----\n","Cypher Query is MATCH (n:Node_201511060800 {id:\"22804\"})-[r:CONNECTS_201511060800]->()\n","RETURN COUNT(r) AS Outdegree_Node_22804_at_t2\n","\n","\n","Neo4j answer is [{'Outdegree_Node_22804_at_t2': 1}]\n","\n","\n","The outdegree of node 22804 of node type Node_201511060800 in the CONNECTS_201511060800 graph at time t2 is 1.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","What is the outdegree of node 22804 at t2?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"yv1vsfn_6xHy","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":5029,"status":"ok","timestamp":1701795563304,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"yv1vsfn_6xHy","outputId":"6e578227-0dba-491e-cc8d-c9f580f97fa9"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the outdegree of node with node_id 48479, of node type Node_201511060000, connected by relationship CONNECTS_201511060000 at time t1.\n","-----\n","Cypher Query is MATCH (n:Node_201511060000 {id: \"48479\"})-[r:CONNECTS_201511060000]->()\n","RETURN count(r) AS Outdegree_t1\n","\n","\n","Neo4j answer is [{'Outdegree_t1': 2}]\n","\n","\n","The outdegree of the node with node_id 48479, of node type Node_201511060000, connected by relationship CONNECTS_201511060000 at time t1 is 2.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1\n","What is the outdegree of node 48479 at t1?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"5im8qAeA6xHy","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":5141,"status":"ok","timestamp":1701795568592,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"5im8qAeA6xHy","outputId":"017eae99-1c77-44f6-e753-e5c5b6287299"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the outdegree of node 48479, of node type Node_201511060800, with the relationship CONNECTS_201511060800, at t2.\n","-----\n","Cypher Query is MATCH (n:Node_201511060800{id:'48479'})-[r:CONNECTS_201511060800]->()\n","RETURN COUNT(r) AS OutdegreeAtT2\n","\n","\n","Neo4j answer is [{'OutdegreeAtT2': 2}]\n","\n","\n","The outdegree of node 48479, of node type Node_201511060800, with the relationship CONNECTS_201511060800, at t2 is 2.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2\n","What is the outdegree of node 48479 at t2?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"kzN3tyGp6xHy","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":5037,"status":"ok","timestamp":1701795574463,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"kzN3tyGp6xHy","outputId":"a4b2e241-1c6b-4d9c-9bf5-7f651c945a9b"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the outdegree of node 28625 with node type Node_201511060000 and relationship CONNECTS_201511060000 at time t1.\n","-----\n","Cypher Query is MATCH (n:Node_201511060000 {id: \"28625\"})-[r:CONNECTS_201511060000]->()\n","RETURN COUNT(r) as OutDegree_t1\n","\n","\n","Neo4j answer is [{'OutDegree_t1': 3}]\n","\n","\n","The outdegree of node 28625 with node type Node_201511060000 and relationship CONNECTS_201511060000 at time t1 is 3.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1\n","What is the outdegree of node 28625 at t1?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"GKajSBAG6xHy","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":7306,"status":"ok","timestamp":1701795581767,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"GKajSBAG6xHy","outputId":"1a5290ec-3cee-4d42-89f4-bbf7bcc15f9f"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the outdegree of node 28625 which has node type Node_201511060800 and relationship CONNECTS_201511060800 at time t2.\n","-----\n","Cypher Query is MATCH (n:Node_201511060800 {id: '28625'})-[r:CONNECTS_201511060800]->() \n","RETURN COUNT(r) AS Outdegree_t2\n","\n","\n","Neo4j answer is [{'Outdegree_t2': 3}]\n","\n","\n","The outdegree of node 28625 with node type Node_201511060800 and relationship CONNECTS_201511060800 at time t2 is 3.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2\n","What is the outdegree of node 28625 at t2?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"w42TogoQxO70","metadata":{"id":"w42TogoQxO70"},"source":["## What is the change in indegree?"]},{"cell_type":"code","execution_count":null,"id":"NLVDOXn5xRjd","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":13977,"status":"ok","timestamp":1701796124760,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"NLVDOXn5xRjd","outputId":"020923bb-9e04-4970-962b-0ad87ca717c2"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the change in the indegree of node 22804 between graph t1 composed of nodes of type Node_201511060000 and relationship CONNECTS_201511060000, and graph t2 composed of nodes of type Node_201511060800 and relationship CONNECTS_201511060800.\n","-----\n","Cypher Query is MATCH (n1:Node_201511060000 {id: '22804'})<-[:CONNECTS_201511060000]-(m1)\n","WITH count(m1) as indegree_t1\n","MATCH (n2:Node_201511060800 {id: '22804'})<-[:CONNECTS_201511060800]-(m2)\n","RETURN count(m2) - indegree_t1 as indegree_change\n","\n","\n","Retrying\n","Generated Cypher Statement is not valid\n","{code: Neo.ClientError.Statement.SyntaxError} {message: Aggregation column contains implicit grouping expressions. For example, in 'RETURN n.a, n.a + n.b + count(*)' the aggregation expression 'n.a + n.b + count(*)' includes the implicit grouping key 'n.b'. It may be possible to rewrite the query by extracting these grouping/aggregation expressions into a preceding WITH clause. Illegal expression(s): indegree_t1 (line 4, column 20 (offset: 197))\n","\"RETURN count(m2) - indegree_t1 as indegree_change\"\n","                    ^}\n","New Cypher Query is MATCH (n1:Node_201511060000 {id: '22804'})<-[:CONNECTS_201511060000]-(m1)\n","WITH count(m1) as indegree_t1\n","MATCH (n2:Node_201511060800 {id: '22804'})<-[:CONNECTS_201511060800]-(m2)\n","WITH indegree_t1, count(m2) as indegree_t2\n","RETURN indegree_t2 - indegree_t1 as indegree_change\n","\n","\n","Neo4j answer is []\n","\n","\n","Whatever you asked in the question does not exist.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1 and\n","all nodes of type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, what is the change in indegree for node 22804?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"ILqRiuXExrZj","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":16426,"status":"ok","timestamp":1701795846249,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"ILqRiuXExrZj","outputId":"8167d4a6-d9af-4f43-895b-441953324219"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the change in indegree for node 48479 in the graph database between time t1, involving nodes of type Node_201511060000 and relationships as CONNECTS_201511060000, and time t2, involving nodes of type Node_201511060800 and relationships as CONNECTS_201511060800.\n","-----\n","Cypher Query is MATCH (n1:Node_201511060000 {id:'48479'})<-[r1:CONNECTS_201511060000]-()\n","RETURN COUNT(r1) AS indegree_time_t1\n","MATCH (n2:Node_201511060800 {id:'48479'})<-[r2:CONNECTS_201511060800]-()\n","RETURN COUNT(r2) AS indegree_time_t2\n","MATCH (n1:Node_201511060000 {id:'48479'}), (n2:Node_201511060800 {id:'48479'})\n","RETURN ABS(COUNT(n1) - COUNT(n2)) AS indegree_change\n","\n","\n","Retrying\n","Generated Cypher Statement is not valid\n","{code: Neo.ClientError.Statement.SyntaxError} {message: RETURN can only be used at the end of the query (line 2, column 1 (offset: 73))\n","\"RETURN COUNT(r1) AS indegree_time_t1\"\n"," ^}\n","New Cypher Query is MATCH (n1:Node_201511060000 {id:'48479'})<-[r1:CONNECTS_201511060000]-()\n","WITH COUNT(r1) AS indegree_time_t1\n","MATCH (n2:Node_201511060800 {id:'48479'})<-[r2:CONNECTS_201511060800]-()\n","WITH indegree_time_t1, COUNT(r2) AS indegree_time_t2\n","RETURN indegree_time_t1, indegree_time_t2, ABS(indegree_time_t1 - indegree_time_t2) AS indegree_change\n","\n","\n","Neo4j answer is [{'indegree_time_t1': 9, 'indegree_time_t2': 10, 'indegree_change': 1}]\n","\n","\n","The change in indegree for node 48479 in the graph database between time t1 and time t2 is 1.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1 and\n","all nodes of type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, what is the change in indegree for node 48479?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"b6f2ZjG7xr1R","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":9929,"status":"ok","timestamp":1701795829825,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"b6f2ZjG7xr1R","outputId":"714ad721-7beb-4b34-fbe7-02b349d56b22"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the change in the indegree of node 28625 between t1 and t2, by considering all nodes of node type Node_201511060000 and relationship CONNECTS_201511060000 as a graph at time t1 and all nodes of type Node_201511060800 and relationship CONNECTS_201511060800 as a graph at time t2.\n","-----\n","Cypher Query is MATCH (node_t1:Node_201511060000{id:\"28625\"})\n","OPTIONAL MATCH (node_t1)<-[:CONNECTS_201511060000]-(any_node_t1:Node_201511060000)\n","WITH COUNT(any_node_t1) AS indegree_t1\n","\n","MATCH (node_t2:Node_201511060800{id:\"28625\"})\n","OPTIONAL MATCH (node_t2)<-[:CONNECTS_201511060800]-(any_node_t2:Node_201511060800)\n","WITH COUNT(any_node_t2) AS indegree_t2, indegree_t1\n","\n","RETURN indegree_t2 - indegree_t1 AS change_in_indegree\n","\n","\n","Neo4j answer is [{'change_in_indegree': 0}]\n","\n","\n","The change in the indegree of node 28625 between times t1 and t2 is 0.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1 and\n","all nodes of type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, what is the change in indegree for node 28625?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"PSD_tVFZyHnn","metadata":{"id":"PSD_tVFZyHnn"},"source":["## What is the change in outdegree?"]},{"cell_type":"code","execution_count":null,"id":"GDY62fhPyJ51","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":15354,"status":"ok","timestamp":1701795875226,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"GDY62fhPyJ51","outputId":"0daac15b-4681-4409-80d1-d0b05d4e7c63"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the change in outdegree for node 22804 between graph at time t1 composed of all nodes of node type Node_201511060000 and relationship CONNECTS_201511060000 and graph at time t2 composed of all nodes of type Node_201511060800 and relationship CONNECTS_201511060800.\n","-----\n","Cypher Query is MATCH (n1:Node_201511060000 {id: '22804'})-[r1:CONNECTS_201511060000]->()\n","WITH COUNT(r1) AS outdegree_t1\n","MATCH (n2:Node_201511060800 {id: '22804'})-[r2:CONNECTS_201511060800]->()\n","RETURN COUNT(r2) - outdegree_t1 AS outdegree_change\n","\n","\n","Retrying\n","Generated Cypher Statement is not valid\n","{code: Neo.ClientError.Statement.SyntaxError} {message: Aggregation column contains implicit grouping expressions. For example, in 'RETURN n.a, n.a + n.b + count(*)' the aggregation expression 'n.a + n.b + count(*)' includes the implicit grouping key 'n.b'. It may be possible to rewrite the query by extracting these grouping/aggregation expressions into a preceding WITH clause. Illegal expression(s): outdegree_t1 (line 4, column 20 (offset: 198))\n","\"RETURN COUNT(r2) - outdegree_t1 AS outdegree_change\"\n","                    ^}\n","New Cypher Query is MATCH (n1:Node_201511060000 {id: '22804'})-[r1:CONNECTS_201511060000]->()\n","WITH COUNT(r1) AS outdegree_t1\n","MATCH (n2:Node_201511060800 {id: '22804'})-[r2:CONNECTS_201511060800]->()\n","WITH outdegree_t1, COUNT(r2) AS outdegree_t2\n","RETURN outdegree_t2 - outdegree_t1 AS outdegree_change\n","\n","\n","Neo4j answer is [{'outdegree_change': 0}]\n","\n","\n","The change in outdegree for node 22804 between the graph at time t1 and t2 is 0.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1 and\n","all nodes of type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, what is the change in outdegree for node 22804?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"dr0sbjwKyJ8P","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":13155,"status":"ok","timestamp":1701795888377,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"dr0sbjwKyJ8P","outputId":"13d6ab6a-bab0-4578-f4eb-2013bd2c73f2"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the difference in outdegree for node 48479 given the graphs constructed by Node_201511060000 and CONNECTS_201511060000 at time t1 and Node_201511060800 and CONNECTS_201511060800 at time t2.\n","-----\n","Cypher Query is MATCH (n1:Node_201511060000 {id: '48479'})-[r1:CONNECTS_201511060000]->()\n","WITH COUNT(r1) AS outDegreeT1\n","MATCH (n2:Node_201511060800 {id: '48479'})-[r2:CONNECTS_201511060800]->()\n","RETURN COUNT(r2) - outDegreeT1 AS outDegreeDifference\n","\n","\n","Retrying\n","Generated Cypher Statement is not valid\n","{code: Neo.ClientError.Statement.SyntaxError} {message: Aggregation column contains implicit grouping expressions. For example, in 'RETURN n.a, n.a + n.b + count(*)' the aggregation expression 'n.a + n.b + count(*)' includes the implicit grouping key 'n.b'. It may be possible to rewrite the query by extracting these grouping/aggregation expressions into a preceding WITH clause. Illegal expression(s): outDegreeT1 (line 4, column 20 (offset: 197))\n","\"RETURN COUNT(r2) - outDegreeT1 AS outDegreeDifference\"\n","                    ^}\n","New Cypher Query is MATCH (n1:Node_201511060000 {id: '48479'})-[r1:CONNECTS_201511060000]->()\n","WITH COUNT(r1) AS outDegreeT1\n","MATCH (n2:Node_201511060800 {id: '48479'})-[r2:CONNECTS_201511060800]->()\n","WITH COUNT(r2) AS outDegreeT2, outDegreeT1\n","RETURN outDegreeT2 - outDegreeT1 AS outDegreeDifference\n","\n","\n","Neo4j answer is [{'outDegreeDifference': 0}]\n","\n","\n","The difference in outdegree for node 48479 between time t1 and t2 is 0.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1 and\n","all nodes of type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, what is the change in outdegree for node 48479?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"5WsdAonxyKFN","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":13537,"status":"ok","timestamp":1701795901911,"user":{"displayName":"Sharika Mahadevan","userId":"04341463379745983655"},"user_tz":360},"id":"5WsdAonxyKFN","outputId":"489bba92-cd5b-410b-d396-11f525213155"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the difference in outdegree between node 28625 in graph Node_201511060000 with relationship CONNECTS_201511060000 at time t1 and graph Node_201511060800 with relationship CONNECTS_201511060800 at time t2.\n","-----\n","Cypher Query is MATCH (n1:Node_201511060000 {id: '28625'})-[r1:CONNECTS_201511060000]->()\n","WITH COUNT(r1) as outdegree_t1\n","MATCH (n2:Node_201511060800 {id: '28625'})-[r2: CONNECTS_201511060800]->()\n","RETURN ABS(COUNT(r2) - outdegree_t1) as outdegree_difference\n","\n","\n","Retrying\n","Generated Cypher Statement is not valid\n","{code: Neo.ClientError.Statement.SyntaxError} {message: Aggregation column contains implicit grouping expressions. For example, in 'RETURN n.a, n.a + n.b + count(*)' the aggregation expression 'n.a + n.b + count(*)' includes the implicit grouping key 'n.b'. It may be possible to rewrite the query by extracting these grouping/aggregation expressions into a preceding WITH clause. Illegal expression(s): outdegree_t1 (line 4, column 24 (offset: 203))\n","\"RETURN ABS(COUNT(r2) - outdegree_t1) as outdegree_difference\"\n","                        ^}\n","New Cypher Query is MATCH (n1:Node_201511060000 {id: '28625'})-[r1:CONNECTS_201511060000]->()\n","WITH COUNT(r1) as outdegree_t1\n","MATCH (n2:Node_201511060800 {id: '28625'})-[r2: CONNECTS_201511060800]->()\n","WITH COUNT(r2) as outdegree_t2, outdegree_t1\n","RETURN ABS(outdegree_t2 - outdegree_t1) as outdegree_difference\n","\n","\n","Neo4j answer is [{'outdegree_difference': 0}]\n","\n","\n","The difference in outdegree between node 28625 in graph Node_201511060000 with relationship CONNECTS_201511060000 at time t1 and graph Node_201511060800 with relationship CONNECTS_201511060800 at time t2 is 0.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node_201511060000 and relationship as CONNECTS_201511060000 as graph at time t1 and\n","all nodes of type Node_201511060800 and relationship as CONNECTS_201511060800 as graph at time t2.\n","Between t1 and t2, what is the change in outdegree for node 28625?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"attachments":{},"cell_type":"markdown","id":"1DmGw5fbxMsH","metadata":{"id":"1DmGw5fbxMsH"},"source":["## Miscellanous"]},{"cell_type":"code","execution_count":null,"id":"e3aa9ee5","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"e3aa9ee5","outputId":"a6b0d43d-365c-4967-e417-bc02ed1e8f07"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the in degree of all nodes with type 'Node' in the graph database.\n","-----\n","Cypher Query is MATCH (n:Node)\n","RETURN n.id as Node_ID, size((n)<-[:CONNECTS]-()) as In_Degree\n","\n","\n","Retrying\n","New Cypher Query is MATCH (n:Node)<-[:CONNECTS]-()\n","RETURN n.id as Node_ID, COUNT(*) as In_Degree\n","\n","\n","Neo4j answer is [{'Node_ID': '42708', 'In_Degree': 1}, {'Node_ID': '50304', 'In_Degree': 4}, {'Node_ID': '3356', 'In_Degree': 5}, {'Node_ID': '45896', 'In_Degree': 4}, {'Node_ID': '8758', 'In_Degree': 3}, {'Node_ID': '6939', 'In_Degree': 2}, {'Node_ID': '4826', 'In_Degree': 1}, {'Node_ID': '38803', 'In_Degree': 1}, {'Node_ID': '2497', 'In_Degree': 2}, {'Node_ID': '4777', 'In_Degree': 3}]\n","\n","\n","The in degree of all nodes with type 'Node' in the graph database are as follows: Node 42708 has an in degree of 1, Node 50304 has an in degree of 4, Node 3356 has an in degree of 5, Node 45896 has an in degree of 4, Node 8758 has an in degree of 3, Node 6939 has an in degree of 2, Node 4826 has an in degree of 1, Node 38803 has an in degree of 1, Node 2497 has an in degree of 2, and Node 4777 has an in degree of 3.\n"]}],"source":["question = \"\"\"\n","What is the in degree of all nodes of type Node?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"a30cffce","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"a30cffce","outputId":"08864afa-5b4f-42e1-86c9-67446dcf81c8"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the country of node 2914.\n","-----\n","Cypher Query is MATCH (n:Node {id:\"2914\"}) RETURN n.country\n","\n","\n","Neo4j answer is [{'n.country': 'US'}]\n","\n","\n","Node 2914 is located in the US.\n"]}],"source":["question = \"\"\"\n","What is the country of node 2914\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"88570513","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"88570513","outputId":"334df694-b30a-41ee-d9c7-ebf83898740c"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the country of node 2915.\n","-----\n","Cypher Query is MATCH (n:Node{id:'2915'}) RETURN n.country\n","\n","\n","Neo4j answer is []\n","\n","\n","Retrying output string\n","The country of node 2915 is unknown.\n"]}],"source":["question = \"\"\"\n","What is the country of node 2915\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"93df3102","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"93df3102","outputId":"77da1463-b5f3-44c1-f634-83404f8c43ab"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the highest indegree of all nodes with the attribute 'country name' set to 'US'.\n","-----\n","Cypher Query is MATCH (n:Node)<-[:CONNECTS]-()\n","WHERE n.country = 'US'\n","RETURN n.as_name AS Node, COUNT(*) AS Indegree\n","ORDER BY Indegree DESC\n","LIMIT 1\n","\n","\n","Neo4j answer is [{'Node': 'LEVEL3', 'Indegree': 5}]\n","\n","\n","Retrying output string\n","The node with the highest indegree and the attribute 'country name' set to 'US' is 'LEVEL3', with an indegree of 5.\n"]}],"source":["question = \"\"\"\n","What is the highest indegree of all nodes with country name as US\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"ab3081bd","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ab3081bd","outputId":"9430262a-e610-4c2a-a4d2-1bb04f4a97e7"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the node with the highest indegree among all nodes with country = AU.\n","-----\n","Cypher Query is MATCH (n:Node {country: 'AU'})\n","RETURN n, size((:Node)-[:CONNECTS]->(n)) AS indegrees\n","ORDER BY indegrees DESC\n","LIMIT 1\n","\n","\n","Retrying\n","New Cypher Query is MATCH (n:Node {country: 'AU'})\n","WITH n, size((:Node)-[:CONNECTS]->n) AS indegrees\n","ORDER BY indegrees DESC\n","LIMIT 1\n","RETURN n\n","\n","\n","Retrying output string\n","The node with the highest indegree among all nodes with country = AU does not exist.\n"]}],"source":["### Only error\n","\n","question = \"\"\"\n","What is the highest indegree of all nodes with country as AU\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"c294b5ff","metadata":{"id":"c294b5ff"},"outputs":[],"source":[]},{"attachments":{},"cell_type":"markdown","id":"bb1ed76b","metadata":{"id":"bb1ed76b"},"source":["## For output"]},{"cell_type":"code","execution_count":null,"id":"d43fa3f0","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"d43fa3f0","outputId":"e53df449-eb71-403b-c846-8c98b52636b9"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find a path from node 3356 to node 7018 for nodes of type node_2.\n","-----\n","Cypher Query is MATCH path = (n:Node_2 {id:'3356'})-[:CONNECTS_2*]->(m:Node_2 {id:'7018'}) \n","RETURN path\n","\n","\n","Neo4j answer is [{'path': [{'country': 'US', 'upstream': '26', 'city': 'Monroe', 'downstream': '5281', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_2', {'upstream': '10', 'downstream': '1660', 'rank': '110', 'id': '3257', 'as_name': 'GTT-BACKBONE'}, 'CONNECTS_2', {'country': 'US', 'upstream': '7', 'city': 'MIDDLETOWN', 'downstream': '1592', 'rank': '2', 'id': '7018', 'state': 'NJ', 'org_name': 'AT&T Services, Inc.', 'as_name': 'ATT-INTERNET4'}]}, {'path': [{'country': 'US', 'upstream': '26', 'city': 'Monroe', 'downstream': '5281', 'rank': '15', 'id': '3356', 'state': 'LA', 'org_name': 'Level 3 Parent, LLC', 'as_name': 'LEVEL3'}, 'CONNECTS_2', {'country': 'US', 'upstream': '7', 'city': 'MIDDLETOWN', 'downstream': '1592', 'rank': '2', 'id': '7018', 'state': 'NJ', 'org_name': 'AT&T Services, Inc.', 'as_name': 'ATT-INTERNET4'}]}]\n","\n","\n","The path from node 3356 to node 7018 for nodes of type node_2 includes node 3356, which is connected to node 3257, and then connects to node 7018.\n"]}],"source":["question = \"\"\"\n","Does a path exist from node 3356 to node 7018 for nodes of type node_2? If so what is the path?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"2c20410a","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"2c20410a","outputId":"f0d8d436-fdc5-4d98-c062-53f10db62a33"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the path from node 123 to node 7671 for nodes of type node_2.\n","-----\n","Cypher Query is MATCH path = (a:Node_2 {id: '123'})-[:CONNECTS_2*]->(b:Node_2 {id: '7671'})\n","RETURN path\n","\n","\n","Neo4j answer is []\n","\n","\n","Retrying output string\n","The path from node 123 to node 7671 for nodes of type node_2 does not exist.\n"]}],"source":["question = \"\"\"\n","Does a path exist from node 123 to node 7671 for nodes of type node_2? If so what is the path?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"425a2f6f","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"425a2f6f","outputId":"631f73a9-af06-4d99-e787-0fb3f7a70195"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the shortest path from node 2519 to node 10026 for nodes of type node_2.\n","-----\n","Cypher Query is MATCH path = shortestPath((n:Node_2 {id: \"2519\"})-[:CONNECTS_2*]-(m:Node_2 {id: \"10026\"}))\n","RETURN path\n","\n","\n","Neo4j answer is [{'path': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]}]\n","\n","\n","The shortest path from node 2519 to node 10026 of type node_2 is as follows: 2519 (VECTANT) connects to 1221 (ASN-TELSTRA), which then connects to 4608 (APNIC-SERVICES), and eventually, connects to node 10026 (TELSTRAGLOBAL).\n"]}],"source":["question = \"\"\"\n","What is the shortest path from node 2519 to node 10026 for nodes of type node_2?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"4d3e1762","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"4d3e1762","outputId":"46b1c642-f583-4b0c-a219-623a5e1681ed"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the change in the number of paths from node 18144 to node 7670 between time t1 (when nodes of type Node and relationships of type CONNECTS are present in the graph) and time t2 (when nodes of type Node_2 and relationships of type CONNECTS_2 are present in the graph).\n","-----\n","Cypher Query is MATCH p1 = (n1:Node {id: \"18144\"})-[:CONNECTS*]->(n2:Node {id: \"7670\"})\n","WITH count(p1) as paths_t1\n","MATCH p2 = (m1:Node_2 {id: \"18144\"})-[:CONNECTS_2*]->(m2:Node_2 {id: \"7670\"})\n","WITH count(p2) as paths_t2, paths_t1\n","RETURN (paths_t2 - paths_t1) as change_in_paths\n","\n","\n","Neo4j answer is [{'change_in_paths': 15}]\n","\n","\n","The change in the number of paths from node 18144 to node 7670 between time t1 and t2 is 15.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node and relationship as CONNECTS as graph at time t1 and\n","all nodes of type Node_2 and relationship as CONNECTS_2 as graph at time t2\n","Between t1 and t2, are there any change in number of paths from node 18144 to node 7670?\n","If so what is the change?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"3ba45ea2","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"3ba45ea2","outputId":"3f4b4825-c918-49dc-d1c4-db0d203b2a15"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find any changes in the paths from node 1136 to node 3333 that occurred between time t1 and t2 in the graph database consisting of nodes of type Node and relationship CONNECTS at time t1 and nodes of type Node_2 and relationship CONNECTS_2 at time t2.\n","-----\n","Cypher Query is MATCH path1 = (x:Node {id: '1136'})-[:CONNECTS*]->(y:Node {id: '3333'})\n","WITH collect(nodes(path1)) as nodes1\n","MATCH path2 = (a:Node_2 {id: '1136'})-[:CONNECTS_2*]->(b:Node_2 {id: '3333'})\n","WITH nodes1, collect(nodes(path2)) as nodes2\n","RETURN nodes1, nodes2\n","\n","\n","Neo4j answer is [{'nodes1': [[{'country': 'NL', 'upstream': '3', 'downstream': '25', 'rank': '108', 'id': '1136', 'org_name': 'KPN B.V.', 'as_name': 'KPN'}, {'upstream': '2', 'downstream': '1', 'rank': '15690', 'id': '3333', 'as_name': 'RIPE-NCC-AS'}]], 'nodes2': [[{'country': 'NL', 'upstream': '3', 'downstream': '25', 'rank': '108', 'id': '1136', 'org_name': 'KPN B.V.', 'as_name': 'KPN'}, {'upstream': '2', 'downstream': '1', 'rank': '15690', 'id': '3333', 'as_name': 'RIPE-NCC-AS'}]]}]\n","\n","\n","There were no changes in the paths from node 1136 to node 3333 between time t1 and t2. The same nodes were involved and the upstream and downstream values remained constant. The rank also stayed the same for both nodes.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node and relationship as CONNECTS as graph at time t1 and\n","all nodes of type Node_2 and relationship as CONNECTS_2 as graph at time t2\n","Between t1 and t2, have the paths from node 1136 to node 3333 changed? If so, how did it change?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"3dcc44ab","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"3dcc44ab","outputId":"67da9c4a-e358-46e6-c9c7-67fb9121c74a"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find all isolated nodes with type node_2 in the network; list them.\n","-----\n","Cypher Query is MATCH (n:Node_2)\n","WHERE NOT (n)-[:CONNECTS_2]-()\n","RETURN n\n","\n","\n","Neo4j answer is []\n","\n","\n","Retrying output string\n","There are no isolated nodes with type node_2 in the network.\n"]}],"source":["question = \"\"\"\n","Are there any isolated nodes of type node_2 in the network? Can you name all?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"28b923f4","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"28b923f4","outputId":"c060fd7c-7aea-4d07-fdef-4bd8934987d6"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find any isolated nodes of type Node in the network and list all names.\n","-----\n","Cypher Query is MATCH (n:Node)\n","WHERE NOT (n)-[:CONNECTS]-()\n","RETURN n.as_name as IsolatedNodeNames\n","\n","\n","Neo4j answer is [{'IsolatedNodeNames': 'LVLT-1'}, {'IsolatedNodeNames': 'UDEL-DCN'}]\n","\n","\n","The isolated nodes in the network are LVLT-1 and UDEL-DCN.\n"]}],"source":["question = \"\"\"\n","Are there any isolated nodes of type Node in the network? Can you name all?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"dea9eda2","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"dea9eda2","outputId":"f331ae47-2f45-4884-8d17-56acb468bf8d"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the highest indegree of all nodes with country equal to 'AU'.\n","-----\n","Cypher Query is MATCH (n:Node)<-[:CONNECTS]-()\n","WHERE n.country = 'AU'\n","RETURN n.id, COUNT(*) AS indegree\n","ORDER BY indegree DESC\n","LIMIT 1\n","\n","\n","Neo4j answer is [{'n.id': '45896', 'indegree': 4}]\n","\n","\n","The highest indegree of all nodes with country equal to 'AU' is 4.\n"]}],"source":["question = \"\"\"\n","What is the highest indegree of all nodes with country as AU\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"a3d9fc9e","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"a3d9fc9e","outputId":"fcbaaa07-33c9-41ff-fa08-a8fae09a6625"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the highest indegree of all nodes with country as AU.\n","-----\n","Cypher Query is MATCH (n:Node) WHERE n.country = 'AU'\n","RETURN n.id, SIZE((:Node)-[:CONNECTS]->(n)) as indegree\n","ORDER BY indegree DESC\n","LIMIT 1\n","\n","\n","Retrying\n","New Cypher Query is MATCH (n:Node) WHERE n.country = 'AU'\n","RETURN n.id, SIZE(()-[:CONNECTS]->(n)) as indegree\n","ORDER BY indegree DESC\n","LIMIT 1\n","\n","\n","Whatever you asked for does not exist.\n"]}],"source":["question = \"\"\"\n","What is the highest indegree of all nodes with country as AU\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"e9da95c7","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"e9da95c7","outputId":"29f5b4b2-0935-4431-d495-f57d000298f7"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the in degree of nodes 209 and 3333.\n","-----\n","Cypher Query is MATCH (n:Node)\n","WHERE n.id IN ['209', '3333']\n","RETURN n.id AS Node, SIZE(()-[:CONNECTS]->(n)) AS InDegree\n","\n","\n","Retrying\n","New Cypher Query is MATCH (n:Node)<-[:CONNECTS]-()\n","WHERE n.id IN ['209', '3333']\n","RETURN n.id AS Node, COUNT(*) AS InDegree\n","\n","\n","Neo4j answer is [{'Node': '3333', 'InDegree': 4}, {'Node': '209', 'InDegree': 1}]\n","\n","\n","The in-degree of node 209 is 1, and the in-degree of node 3333 is 4.\n"]}],"source":["question = \"\"\"\n","What is the in degree of nodes 209 and 3333?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"d8776d6d","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"d8776d6d","outputId":"3737e0c8-3dc9-4fb2-ea62-1bf0223abe0f"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the in degree of nodes 209 and 3333.\n","-----\n","Cypher Query is MATCH (n:Node)\n","WHERE n.id IN ['209', '3333']\n","RETURN n.id, SIZE(()-[:CONNECTS]->(n)) as inDegree\n","\n","\n","Retrying\n","New Cypher Query is MATCH (n:Node)<-[:CONNECTS]-()\n","WHERE n.id IN ['209', '3333']\n","RETURN n.id as nodeId, COUNT(*) as inDegree\n","\n","\n","Neo4j answer is [{'nodeId': '3333', 'inDegree': 4}, {'nodeId': '209', 'inDegree': 1}]\n","\n","\n","The in degree of node 209 is 1, and for node 3333, it is 4.\n"]}],"source":["question = \"\"\"\n","What is the in degree of nodes 209 and 3333?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"7c985231","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"7c985231","outputId":"4e54d0b7-d6fd-4aa2-fad8-305d47fe054a"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the changes in the paths from node 2519 to node 10026 between time t1 and t2, considering all nodes of type Node as graph at time t1 and all nodes of type Node_2 as graph at time t2.\n","-----\n","Cypher Query is MATCH path1 = (n1:Node{ id: '2519' })-[:CONNECTS*]->(n2:Node{ id: '10026' })\n","WITH collect(path1) AS paths_t1\n","MATCH path2 = (n1:Node_2{ id: '2519' })-[:CONNECTS_2*]->(n2:Node_2{ id: '10026' })\n","WITH paths_t1, collect(path2) AS paths_t2\n","RETURN paths_t1 AS Paths_at_t1, paths_t2 AS Paths_at_t2\n","\n","\n","Neo4j answer is [{'Paths_at_t1': [[{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]], 'Paths_at_t2': [[{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '8', 'downstream': '437', 'rank': '920', 'id': '4826', 'org_name': 'VOCUS PTY LTD', 'as_name': 'VOCUS-BACKBONE-AS'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '8', 'downstream': '437', 'rank': '920', 'id': '4826', 'org_name': 'VOCUS PTY LTD', 'as_name': 'VOCUS-BACKBONE-AS'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]]}]\n","\n","\n","At time t1, node 2519 connects directly to node 10026. However, at time t2, there are several paths from node 2519 to node 10026, passing through different nodes. One of these paths is through nodes 1221, 38803, 4826, and 4608. Another path includes nodes 1221, 38803, 1221, 4608. A third path involves nodes 1221, 38803, 1221, 4637, 1221, 4608. Other paths also involve similar nodes with different combinations. Please note that all node IDs mentioned are representing different nodes in the network graph.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node as graph at time t1 and all nodes of type Node_2 as graph at time t2\n","Between t1 and t2, have the paths from node 2519 to node 10026 changed? If so, how did it change?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]},{"cell_type":"code","execution_count":null,"id":"c426acc6","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"c426acc6","outputId":"19eb2bf2-6b29-4469-c889-0083264283c8"},"outputs":[{"name":"stdout","output_type":"stream","text":["Refined user input: Find the changes in paths from node 2519 to node 10026 between graph of node type Node at time t1 and graph of node type Node_2 at time t2.\n","-----\n","Cypher Query is MATCH p1=(n1:Node {id:'2519'})-[:CONNECTS*]->(m1:Node {id:'10026'})\n","MATCH p2=(n2:Node_2 {id:'2519'})-[:CONNECTS_2*]->(m2:Node_2 {id:'10026'})\n","RETURN p1 AS Path_at_T1, p2 AS Path_at_T2\n","\n","\n","Neo4j answer is [{'Path_at_T1': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], 'Path_at_T2': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '8', 'downstream': '437', 'rank': '920', 'id': '4826', 'org_name': 'VOCUS PTY LTD', 'as_name': 'VOCUS-BACKBONE-AS'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]}, {'Path_at_T1': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], 'Path_at_T2': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]}, {'Path_at_T1': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], 'Path_at_T2': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]}, {'Path_at_T1': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], 'Path_at_T2': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]}, {'Path_at_T1': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], 'Path_at_T2': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '8', 'downstream': '437', 'rank': '920', 'id': '4826', 'org_name': 'VOCUS PTY LTD', 'as_name': 'VOCUS-BACKBONE-AS'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]}, {'Path_at_T1': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], 'Path_at_T2': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '0', 'rank': '9740', 'id': '38803', 'org_name': 'Wirefreebroadband Pty Ltd', 'as_name': 'WPL-AS-AP'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]}, {'Path_at_T1': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}], 'Path_at_T2': [{'country': 'JP', 'upstream': '3', 'downstream': '64', 'rank': '314', 'id': '2519', 'as_name': 'VECTANT'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '10', 'downstream': '458', 'rank': '555', 'id': '4637', 'org_name': 'Telstra International Limited', 'as_name': 'ASN-TELSTRA-GLOBAL'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '2', 'downstream': '225', 'rank': '61', 'id': '1221', 'org_name': 'Telstra Corporation Limited', 'as_name': 'ASN-TELSTRA'}, 'CONNECTS_2', {'country': 'AU', 'upstream': '3', 'downstream': '193', 'rank': '3029', 'id': '4608', 'org_name': 'Asia Pacific Network Information Centre', 'as_name': 'APNIC-SERVICES'}, 'CONNECTS_2', {'country': 'AU', 'id': '10026', 'org_name': 'Telstra International Limited', 'as_name': 'TELSTRAGLOBAL'}]}]\n","\n","\n","At time T1, the path from node 2519 to node 10026 was direct. However, at time T2, several new nodes were introduced in this path. The nodes which came into play in path at T2 and not present on T1 are nodes 1221, 38803, 4826, 4608, and 4637. But, please note that nodes may be repeated multiple times in T2 paths.\n"]}],"source":["question = \"\"\"\n","Consider all nodes of node type Node as graph at time t1 and all nodes of type Node_2 as graph at time t2\n","Between t1 and t2, have the paths from node 2519 to node 10026 changed? If so, how did it change?\n","\"\"\"\n","question = refine_prompt(question)[\"updated_user_prompt\"]\n","print(\"Refined user input:\", question)\n","print(\"-----\")\n","response = lang_chain_custom(question,driver,model='gpt-4')\n","print(response)"]}],"metadata":{"colab":{"collapsed_sections":["9YjQcZVru6Ne","sJDezt0Dv9bv"],"provenance":[]},"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.9.12"}},"nbformat":4,"nbformat_minor":5}
